life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
#ifndef ISM330DHCX_REGS_H
#define ISM330DHCX_REGS_H

 /* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include <math.h>

#define ISM3320DHCX_I2C_ADD_L   0x6AU
#define ISM3320DHCX_I2C_ADD_H   0x6BU

/* 7bytes-> Adress + 1byte -> R/W */
#define ISM3320DHCX_I2C_ADD_L_W	0xD4U
#define ISM3320DHCX_I2C_ADD_L_R	0xD5U

#define ISM3320DHCX_I2C_ADD_H_W	0xD6U
#define ISM3320DHCX_I2C_ADD_H_R	0xD7U



#define ISM3320DHCX_WHO_AM_I    0x6BU

#define PROPERTY_DISABLE                (0U)
#define PROPERTY_ENABLE                 (1U)

/* Pointers to the read/write functions */
typedef int32_t (*_write_ptr)(void*, uint8_t, uint8_t*, uint16_t);
typedef int32_t (*_read_ptr)(void*, uint8_t, uint8_t*, uint16_t);

/* ISM330DHCX Handler Structure */
typedef struct {
    _write_ptr  write;			//< Pointer to the Write function
    _read_ptr   read;			//< Pointer to the Read function

    void *handle;				//< Pointer to the communication peripheral handler
} ISM330DHCX_HandleTypeDef;

/* Register's Adress */
#define    FUNC_CFG_ACCESS				  0x01U  /*  1byte   /   RW  */
#define    PIN_CTRL						  0x02U  /*  1byte   /   RW  */
#define    RESERVED_0					  0x03U  /*  4byte   /   --  */
#define    FIFO_CTRL1       			  0x07U  /*  1byte   /   RW  */
#define    FIFO_CTRL2                     0x08U  /*  1byte   /   RW  */
#define    FIFO_CTRL3                     0x09U  /*  1byte   /   RW  */
#define    FIFO_CTRL4                     0x0AU  /*  1byte   /   RW  */
#define    COUNTER_BDR_REG1               0x0BU  /*  1byte   /   RW  */
#define    COUNTER_BDR_REG2               0x0CU  /*  1byte   /   RW  */
#define    INT1_CTRL                      0x0DU  /*  1byte   /   RW  */
#define    INT2_CTRL                      0x0EU  /*  1byte   /   RW  */
#define    WHO_AM_I                       0x0FU  /*  1byte   /   RO  */
#define    CTRL1_XL                       0x10U  /*  1byte   /   RW  */
#define    CTRL2_G                        0x11U  /*  1byte   /   RW  */
#define    CTRL3_C                        0x12U  /*  1byte   /   RW  */
#define    CTRL4_C                        0x13U  /*  1byte   /   RW  */
#define    CTRL5_C                        0x14U  /*  1byte   /   RW  */
#define    CTRL6_C                        0x15U  /*  1byte   /   RW  */
#define    CTRL7_G                        0x16U  /*  1byte   /   RW  */
#define    CTRL8_XL                       0x17U  /*  1byte   /   RW  */
#define    CTRL9_XL                       0x18U  /*  1byte   /   RW  */
#define    CTRL10_C                       0x19U  /*  1byte   /   RW  */
#define    ALL_INT_SRC                    0x1AU  /*  1byte   /   RO  */
#define    WAKE_UP_SRC                    0x1BU  /*  1byte   /   RO  */
#define    TAP_SRC                        0x1CU  /*  1byte   /   RO  */
#define    D6D_SRC                        0x1DU  /*  1byte   /   RO  */
#define    STATUS_SPIAUX                  0x1EU  /*  1byte   /   RO  */
#define    RESERVED_1                     0x1FU  /*  1byte   /   --  */
#define    OUT_TEMP_L                     0x20U  /*  1byte   /   RO  */
#define    OUT_TEMP_H                     0x21U  /*  1byte   /   RO  */
#define    OUTX_L_G                       0x22U  /*  1byte   /   RO  */
#define    OUTX_H_G                       0x23U  /*  1byte   /   RO  */
#define    OUTY_L_G                       0x24U  /*  1byte   /   RO  */
#define    OUTY_H_G                       0x25U  /*  1byte   /   RO  */
#define    OUTZ_L_G                       0x26U  /*  1byte   /   RO  */
#define    OUTZ_H_G                       0x27U  /*  1byte   /   RO  */
#define    OUTX_L_A                       0x28U  /*  1byte   /   RO  */
#define    OUTX_H_A                       0x29U  /*  1byte   /   RO  */
#define    OUTY_L_A                       0x2AU  /*  1byte   /   RO  */
#define    OUTY_H_A                       0x2BU  /*  1byte   /   RO  */
#define    OUTZ_L_A                       0x2CU  /*  1byte   /   RO  */
#define    OUTZ_H_A                       0x2DU  /*  1byte   /   RO  */
#define    RESERVED_2                     0x2EU  /*  7byte   /   --  */
#define    EMB_FUNC_STATUS_MAINPAGE       0x35U  /*  1byte   /   RO  */
#define    FSM_STATUS_A_MAINPAGE          0x36U  /*  1byte   /   RO  */
#define    FSM_STATUS_B_MAINPAGE          0x37U  /*  1byte   /   RO  */
#define    MLC_STATUS_MAINPAGE            0x38U  /*  1byte   /   RO  */
#define    STATUS_MASTER_MAINPAGE         0x39U  /*  1byte   /   RO  */
#define    FIFO_STATUS1                   0x3AU  /*  1byte   /   RO  */
#define    FIFO_STATUS2                   0x3BU  /*  4byte   /   --  */
#define    RESERVED_3                      0x3CU  /*  1byte   /   RO  */
#define    TIMESTAMP0                     0x40U  /*  1byte   /   RO  */
#define    TIMESTAMP1                     0x41U  /*  1byte   /   RO  */
#define    TIMESTAMP2                     0x42U  /*  1byte   /   RO  */
#define    TIMESTAMP3                     0x43U  /*  1byte   /   RO  */
#define    RESERVED_4                      0x44U  /*  13byte  /   --  */
#define    TAP_CFG0                       0x56U  /*  1byte   /   RW  */
#define    TAP_CFG1                       0x57U  /*  1byte   /   RW  */
#define    TAP_CFG2                       0x58U  /*  1byte   /   RW  */
#define    TAP_THS_6D                     0x59U  /*  1byte   /   RW  */
#define    INT_DUR2                       0x5AU  /*  1byte   /   RW  */
#define    WAKE_UP_THS                    0x5BU  /*  1byte   /   RW  */
#define    WAKE_UP_DUR                    0x5CU  /*  1byte   /   RW  */
#define    FREE_FALL                      0x5DU  /*  1byte   /   RW  */
#define    MD1_CFG                        0x5EU  /*  1byte   /   RW  */
#define    MD2_CFG                        0x5FU  /*  1byte   /   RW  */
#define    RESERVED_5                      0x60U  /*  3byte   /   --  */
#define    INTERNAL_FREQ_FINE             0x63U  /*  1byte   /   RO  */
#define    RESERVED_6                      0x64U  /*  11byte  /   --  */
#define    INT_OIS                        0x6FU  /*  1byte   /   RO  */
#define    CTRL1_OIS                      0x70U  /*  1byte   /   RO  */
#define    CTRL2_OIS                      0x71U  /*  1byte   /   RO  */
#define    CTRL3_OIS                      0x72U  /*  1byte   /   RO  */
#define    X_OFS_USR                      0x73U  /*  1byte   /   RW  */
#define    Y_OFS_USR                      0x74U  /*  1byte   /   RW  */
#define    Z_OFS_USR                      0x75U  /*  1byte   /   RW  */
#define    RESERVED_7                      0x76U  /*  2byte   /   --  */
#define    FIFO_DATA_OUT_TAG              0x78U  /*  1byte   /   RO  */
#define    FIFO_DATA_OUT_X_L              0x79U  /*  1byte   /   RO  */
#define    FIFO_DATA_OUT_X_H              0x7AU  /*  1byte   /   RO  */
#define    FIFO_DATA_OUT_Y_L              0x7BU  /*  1byte   /   RO  */
#define    FIFO_DATA_OUT_Y_H              0x7CU  /*  1byte   /   RO  */
#define    FIFO_DATA_OUT_Z_L              0x7DU  /*  1byte   /   RO  */
#define    FIFO_DATA_OUT_Z_H              0x7EU   /*  1byte   /   RO  */

