life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
/*
 *  @brief	Embedded Function Adress Register
 *
 *  @note	Actif only if FUNC_CFG_EN is set to '1' in FUNC_CFG_ACCESS (01h).
 */
typedef enum {
    PAGE_SEL                    =   0x02,
    RESERVED                    =   0x03,
    EMB_FUNC_EN_A               =   0x04,
    EMB_FUNC_EN_B               =   0x05,
    PAGE_ADDRESS                =   0x08,
    PAGE_VALUE                  =   0x09,
    EMB_FUNC_INT1               =   0x0A,
    FSM_INT1_A                  =   0x0B,
    FSM_INT1_B                  =   0x0C,
    MLC_INT1                    =   0x0D,
    EMB_FUNC_INT2               =   0x0E,
    FSM_INT2_A                  =   0x0F,
    FSM_INT2_B                  =   0x10,
    MLC_INT2                    =   0x11,
    EMB_FUNC_STATUS             =   0x12,
    FSM_STATUS_A                =   0x13,
    FSM_STATUS_B                =   0x14,
    MLC_STATUS                  =   0x15,
    PAGE_RW                     =   0x17,
            /*  RESERVED - 18-43 */
    EMB_FUNC_FIFO_CFG           =   0x44,
    FSM_ENABLE_A                =   0x46,
    FSM_ENABLE_B                =   0x47,
    FSM_LONG_COUNTER_L          =   0x48,
    FSM_LONG_COUNTER_H          =   0x49,
    FSM_LONG_COUNTER_CLEAR      =   0x4A,
    FSM_OUTS1                   =   0x4C,
    FSM_OUTS2                   =   0x4D,
    FSM_OUTS3                   =   0x4E,
    FSM_OUTS4                   =   0x4F,
    FSM_OUTS5                   =   0x50,
    FSM_OUTS6                   =   0x51,
	EMB_FUNC_ODR_CFG_B          =	0x5F,
	EMB_FUNC_ODR_CFG_C          =	0x60,
	ISM330DHCX_STEP_COUNTER_L   =	0x62,
	STEP_COUNTER_H              =	0x63,
	EMB_FUNC_SRC                =	0x64,
	EMB_FUNC_INIT_A             =	0x66,
	EMB_FUNC_INIT_B             =	0x67,
	MLC0_SRC                    =	0x70,
	MLC1_SRC                    =	0x71,
	MLC2_SRC                    =	0x72,
	MLC3_SRC                    =	0x73,
	MLC4_SRC                    =	0x74,
	MLC5_SRC                    =	0x75,
	MLC6_SRC                    =	0x76,
	MLC7_SRC                    =	0x77
} ism330_embfnc;

/*
 *  @brief	Embedded function page 0 Adress Register (External Magnetometer )
 *
 */
typedef enum {
    MAG_SENSITIVITY_L           =   0xBA,
    MAG_SENSITIVITY_H           =   0xBB,
    MAG_OFFX_L                  =   0xC0,
    MAG_OFFX_H                  =   0xC1,
    MAG_OFFY_L                  =   0xC2,
    MAG_OFFY_H                  =   0xC3,
    MAG_OFFZ_L                  =   0xC4,
    MAG_OFFZ_H                  =   0xC5,
    MAG_SI_XX_L                 =   0xC6,
    MAG_SI_XX_H                 =   0xC7,
    MAG_SI_XY_L                 =   0xC8,
    MAG_SI_XY_H                 =   0xC9,
    MAG_SI_XZ_L                 =   0xCA,
    MAG_SI_XZ_H                 =   0xCB,
    MAG_SI_YY_L                 =   0xCC,
    MAG_SI_YY_H                 =   0xCD,
    MAG_SI_YZ_L                 =   0xCE,
    MAG_SI_YZ_H                 =   0xCF,
    MAG_SI_ZZ_L                 =   0xD0,
    MAG_SI_ZZ_H                 =   0xD1,
    MAG_CFG_A                   =   0xD4,
    MAG_CFG_B                   =   0xD5,
    FSM_LC_TIMEOUT_L            =   0x7A,
    FSM_LC_TIMEOUT_H            =   0x7B,
    FSM_PROGRAMS                =   0x7C,
    FSM_START_ADD_L             =   0x7E,
    FSM_START_ADD_H             =   0x7F,
    PEDO_CMD_REG                =   0x83,
    PEDO_DEB_STEPS_CONF         =   0x84,
    PEDO_SC_DELTAT_L            =   0xD0,
    PEDO_SC_DELTAT_H            =   0xD1,
    MLC_MAG_SENSITIVITY_L       =   0xE8,
    MLC_MAG_SENSITIVITY_H       =   0xE9
} ism330_embfnc_page0;

/*
 *  @brief	Sensor Hub Adress Register
 *
 */
typedef enum {
    SENSOR_HUB_1 = 0x02,
    SENSOR_HUB_2 = 0x03,
    SENSOR_HUB_3 = 0x04,
    SENSOR_HUB_4 = 0x05,
    SENSOR_HUB_5 = 0x06,
    SENSOR_HUB_6 = 0x07,
    SENSOR_HUB_7 = 0x08,
    SENSOR_HUB_8 = 0x09,
    SENSOR_HUB_9 = 0x0A,
    SENSOR_HUB_10 = 0x0B,
    SENSOR_HUB_11 = 0x0C,
    SENSOR_HUB_12 = 0x0D,
    SENSOR_HUB_13 = 0x0E,
    SENSOR_HUB_14 = 0x0F,
    SENSOR_HUB_15 = 0x10,
    SENSOR_HUB_16 = 0x11,
    SENSOR_HUB_17 = 0x12,
    SENSOR_HUB_18 = 0x13,
    MASTER_CONFIG = 0x14,
    SLV0_ADD = 0x15,
    SLV0_SUBADD = 0x16,
    SLV0_CONFIG = 0x17,
    SLV1_ADD = 0x18,
    SLV1_SUBADD = 0x19,
    SLV1_CONFIG = 0x1A,
    SLV2_ADD = 0x1B,
    SLV2_SUBADD = 0x1C,
    SLV2_CONFIG = 0x1D,
    SLV3_ADD = 0x1E,
    SLV3_SUBADD = 0x1F,
    SLV3_CONFIG = 0x20,
    DATAWRITE_SLV0 = 0x21,
    STATUS_MASTER = 0x22
} ism330_sensor_hub;

/*  For all next registers:
 *  - Default value (if no notes), = 0x00
 *  - Format Little-Endian
 */

/* Enable embedded functions register */
typedef struct {
    uint8_t reserved0           : 6;
    /// Enable access to the embedded functions configuration registers.
    uint8_t reg_access		    : 2;
} ism330dhcx_func_cfg_access_t;

typedef enum {
  ISM330DHCX_USER_BANK           = 0,
  ISM330DHCX_SENSOR_HUB_BANK     = 1,
  ISM330DHCX_EMBEDDED_FUNC_BANK  = 2,
} ism330dhcx_reg_access_t;

/* Pins pull-up enable/disable register */
typedef struct {
    uint8_t reserved0           : 6;        // To '1'
    /// Enable pull-up on SDO pin.
    uint8_t ois_pu_en           : 1;
    /// Disable pull-up on both OCS_Aux and SDO_Aux pins.
    uint8_t ois_pu_dis          : 1;
} ism330dhcx_pin_ctrl_t;

typedef enum {
  ISM330DHCX_PULL_UP_DISC       = 0,
  ISM330DHCX_PULL_UP_CONNECT    = 1,
} ism330dhcx_sdo_pu_en_t;

typedef enum {
  ISM330DHCX_AUX_PULL_UP_DISC       = 0,
  ISM330DHCX_AUX_PULL_UP_CONNECT    = 1,
} ism330dhcx_ois_pu_dis_t;

/* FIFO Control register 1 */
typedef struct {
    /// FIFO watermark threshold, in conjunction withm WTM8 (fifo_ctrl2)
    uint8_t wtm                 : 8;
} ism330dhcx_fifo_ctrl1_t;

/* FIFO Control register 2 */
typedef struct {
    /// FIFO watermark threshold, in conjunction with WTM[7:0] in fifo_ctrl1
    uint8_t wtm8                : 1;
    /// This field configures the compression algorithm to write non-compressed data at each rate.
    uint8_t uncoptr_rate        : 2;
    uint8_t reserved0           : 1;
    /// Enables ODR CHANGE virtual sensor to be batched in FIFO
    uint8_t odrchg_en           : 1;
    uint8_t reserved1           : 1;
    /// Enables/Disables compression algorithm runtime
    uint8_t fifo_compr_rt_en    : 1;
    /// Sensing chain FIFO stop values memorization at threshold level
    uint8_t stop_on_wtm         : 1;
} ism330dhcx_ctrl2_t;

