life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
typedef enum {
  ISM330DHCX_CMP_DISABLE  = 0x00,
  ISM330DHCX_CMP_ALWAYS   = 0x04,
  ISM330DHCX_CMP_8_TO_1   = 0x05,
  ISM330DHCX_CMP_16_TO_1  = 0x06,
  ISM330DHCX_CMP_32_TO_1  = 0x07,
} ism330dhcx_uncoptr_rate_t;

/* FIFO Control register 3 */
typedef struct {
    /// Selects Batch Data Rate (write frequency in FIFO) for accelerometer data.
    uint8_t bdr_xl              : 4;
    /// Selects Batch Data Rate (write frequency in FIFO) for gyroscope data.
    uint8_t bdr_gy              : 4;
} ism330dhcx_fifo_ctrl3_t;

typedef enum {
  ISM330DHCX_XL_NOT_BATCHED       =  0,
  ISM330DHCX_XL_BATCHED_AT_12Hz5   =  1,
  ISM330DHCX_XL_BATCHED_AT_26Hz    =  2,
  ISM330DHCX_XL_BATCHED_AT_52Hz    =  3,
  ISM330DHCX_XL_BATCHED_AT_104Hz   =  4,
  ISM330DHCX_XL_BATCHED_AT_208Hz   =  5,
  ISM330DHCX_XL_BATCHED_AT_417Hz   =  6,
  ISM330DHCX_XL_BATCHED_AT_833Hz   =  7,
  ISM330DHCX_XL_BATCHED_AT_1667Hz  =  8,
  ISM330DHCX_XL_BATCHED_AT_3333Hz  =  9,
  ISM330DHCX_XL_BATCHED_AT_6667Hz  = 10,
  ISM330DHCX_XL_BATCHED_AT_6Hz5    = 11,
} ism330dhcx_bdr_xl_t;

typedef enum {
  ISM330DHCX_GY_NOT_BATCHED         = 0,
  ISM330DHCX_GY_BATCHED_AT_12Hz5    = 1,
  ISM330DHCX_GY_BATCHED_AT_26Hz     = 2,
  ISM330DHCX_GY_BATCHED_AT_52Hz     = 3,
  ISM330DHCX_GY_BATCHED_AT_104Hz    = 4,
  ISM330DHCX_GY_BATCHED_AT_208Hz    = 5,
  ISM330DHCX_GY_BATCHED_AT_417Hz    = 6,
  ISM330DHCX_GY_BATCHED_AT_833Hz    = 7,
  ISM330DHCX_GY_BATCHED_AT_1667Hz   = 8,
  ISM330DHCX_GY_BATCHED_AT_3333Hz   = 9,
  ISM330DHCX_GY_BATCHED_AT_6667Hz   = 10,
  ISM330DHCX_GY_BATCHED_6Hz5        = 11,
} ism330dhcx_bdr_gy_t;

/* FIFO Control register 4 */
typedef struct {
    /// FIFO mode selection
    uint8_t fifo_mode           : 3;
    uint8_t reserved0           : 1;
    /// Selects batch data rate (write frequency in FIFO) for temperature data
    uint8_t odr_t_batch         : 2;
    /// Selects decimation for timestamp batching in FIFO. Write rate will be the maximum rate between XL
    uint8_t dec_ts_batch        : 2;
} ism330dhcx_fifo_ctrl4_t;

typedef enum {
  ISM330DHCX_BYPASS_MODE             = 0,
  ISM330DHCX_FIFO_MODE               = 1,
  ISM330DHCX_STREAM_TO_FIFO_MODE     = 3,
  ISM330DHCX_BYPASS_TO_STREAM_MODE   = 4,
  ISM330DHCX_STREAM_MODE             = 6,
  ISM330DHCX_BYPASS_TO_FIFO_MODE     = 7,
} ism330dhcx_fifo_mode_t;

typedef enum {
  ISM330DHCX_NO_DECIMATION = 0,
  ISM330DHCX_DEC_1         = 1,
  ISM330DHCX_DEC_8         = 2,
  ISM330DHCX_DEC_32        = 3,
} ism330dhcx_dec_ts_batch_t;

typedef enum {
  ISM330DHCX_TEMP_NOT_BATCHED        = 0,
  ISM330DHCX_TEMP_BATCHED_AT_52Hz    = 1,
  ISM330DHCX_TEMP_BATCHED_AT_12Hz5   = 2,
  ISM330DHCX_TEMP_BATCHED_AT_1Hz6    = 3,
} ism330dhcx_odr_t_batch_t;

/* Counter batch data rate register 1 */
typedef struct {
    /// In conjunction with CNT_BDR_TH_[7:0] in COUNTER_BDR_REG2 (0Ch),
    uint8_t cnt_bdr_th          : 3;
    uint8_t reserved0           : 2;
    /// Selects the trigger for the internal counter of batch events between XL and gyro.
    uint8_t trig_counter_bdr    : 1;
    /// Resets the internal counter of batch events for a single sensor.
    uint8_t rst_counter_bdr     : 1;
    /// Enables pulsed data-ready mode
    uint8_t dataready_pulsed    : 1;
} ism330dhcx_counter_bdr_reg1_t;

typedef enum {
  ISM330DHCX_XL_BATCH_EVENT   = 0,
  ISM330DHCX_GYRO_BATCH_EVENT = 1,
} ism330dhcx_trig_counter_bdr_t;

typedef enum {
  ISM330DHCX_DRDY_LATCHED = 0,
  ISM330DHCX_DRDY_PULSED  = 1,
} ism330dhcx_dataready_pulsed_t;

/* Counter batch data rate register 2 */
typedef struct {
    /// In conjunction with CNT_BDR_TH_[8:10] in COUNTER_BDR_REG1
    uint8_t cnt_bdr_th          : 8;
} ism330dhcx_counter_bdr_reg2_t;

/* INT1 pin control register */
typedef struct {
    //  Enables accelerometer data-ready interrupt on INT1 pin.
    uint8_t int1_drdy_xl        : 1;
    //  Enables gyroscope data-ready interrupt on INT1 pin.
    uint8_t int1_drdx_g         : 1;
    //  Enables boot status on INT1 pin.
    uint8_t int1_boot           : 1;
    //  Enables FIFO threshold interrupt on INT1 pin.
    uint8_t int1_fifo_th        : 1;
    //  Enables FIFO overrun interrupt on INT1 pin.
    uint8_t int1_fifo_ovr       : 1;
    //  Enables FIFO full flag interrupt on INT1 pin.
    uint8_t int1_fifo_full      : 1;
    //  Enables COUNTER_BDR_IA interrupt on INT1.
    uint8_t int1_cnt_bdr        : 1;
    //  Sends DEN_DRDY (DEN stamped on Sensor Data flag) to INT1 pin.
    uint8_t den_drdy_flag       : 1;
} ism330dhcx_int1_ctrl_t;

/* INT2 pin control register */
typedef struct {
    //  Enables accelerometer data-ready interrupt on INT2 pin.
    uint8_t int2_drdy_xl        : 1;
    //  Enables gyroscope data-ready interrupt on INT2 pin.
    uint8_t int2_drdx_g         : 1;
    //  Enables boot status on INT2 pin.
    uint8_t int2_boot           : 1;
    //  Enables FIFO threshold interrupt on INT2 pin.
    uint8_t int2_fifo_th        : 1;
    //  Enables FIFO overrun interrupt on INT2 pin.
    uint8_t int2_fifo_ovr       : 1;
    //  Enables FIFO full flag interrupt on INT2 pin.
    uint8_t int2_fifo_full      : 1;
    //  Enables COUNTER_BDR_IA interrupt on INT2.
    uint8_t int2_cnt_bdr        : 1;
    uint8_t reserved0           : 1;
} ism330dhcx_int2_ctrl_t;

/* Who Am I register */
typedef struct {
    //  This is a read-only register.
    //  Its value is fixed at 6Bh.
    uint8_t who_am_i            : 8;
} ism330dhcx_who_am_i_t;

/* Accelerometer control register 1 */
typedef struct {
    uint8_t reserved0           : 1;
    //  Accelerometer high-resolution selection.
    uint8_t lpf2_xl_en          : 1;
    //  Accelerometer full-scale selection.
    uint8_t fs_xl               : 2;
    //  Accelerometer ODR selection.
    uint8_t odr_xl              : 4;
} ism330dhcx_ctrl1_xl_t;

typedef enum {
    ISM330DHCX_2g   = 0,
    ISM330DHCX_16g  = 1, /* if XL_FS_MODE = ‘1’ -> ISM330DHCX_2g */
    ISM330DHCX_4g   = 2,
    ISM330DHCX_8g   = 3,
} ism330dhcx_fs_xl_t;

typedef enum {
  ISM330DHCX_XL_ODR_OFF    = 0,
  ISM330DHCX_XL_ODR_12Hz5  = 1,
  ISM330DHCX_XL_ODR_26Hz   = 2,
  ISM330DHCX_XL_ODR_52Hz   = 3,
  ISM330DHCX_XL_ODR_104Hz  = 4,
  ISM330DHCX_XL_ODR_208Hz  = 5,
  ISM330DHCX_XL_ODR_417Hz  = 6,
  ISM330DHCX_XL_ODR_833Hz  = 7,
  ISM330DHCX_XL_ODR_1667Hz = 8,
  ISM330DHCX_XL_ODR_3333Hz = 9,
  ISM330DHCX_XL_ODR_6667Hz = 10,
  ISM330DHCX_XL_ODR_6Hz5   = 11, /* (low power only) */
} ism330dhcx_odr_xl_t;

/* Gyroscope control register 2 */
typedef struct {
    //  Selects gyro chain full-scale ±4000 dps.
    uint8_t fs_4000         : 1;
    //  Selects gyro chain full-scale ±125 dps
    uint8_t fs_125          : 1;
    //  Gyroscope chain full-scale selection
    uint8_t fs_g            : 2;
    //  Gyroscope output data rate selection.
    uint8_t odr_g           : 4;
} ism330dhcx_ctrl2_g_t;

