life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
typedef enum {
  ISM330DHCX_250dps = 0,
  ISM330DHCX_500dps = 1,
  ISM330DHCX_1000dps = 2,
  ISM330DHCX_2000dps = 3,
} ism330dhcx_fs_g_t;

typedef enum {
  ISM330DHCX_GY_ODR_OFF    = 0,
  ISM330DHCX_GY_ODR_12Hz5  = 1,
  ISM330DHCX_GY_ODR_26Hz   = 2,
  ISM330DHCX_GY_ODR_52Hz   = 3,
  ISM330DHCX_GY_ODR_104Hz  = 4,
  ISM330DHCX_GY_ODR_208Hz  = 5,
  ISM330DHCX_GY_ODR_417Hz  = 6,
  ISM330DHCX_GY_ODR_833Hz  = 7,
  ISM330DHCX_GY_ODR_1667Hz = 8,
  ISM330DHCX_GY_ODR_3333Hz = 9,
  ISM330DHCX_GY_ODR_6667Hz = 10,
} ism330dhcx_odr_g_t;

/* Control register 3 */
typedef struct {
    //  Software reset.
    uint8_t sw_reset            : 1;
    uint8_t reserved0           : 1;
    //  Register address automatically incremented during a multiple byte access with a serial interface (I²C or SPI).
    uint8_t if_inc              : 1;
    //  SPI Serial Interface Mode selection.
    uint8_t sim                 : 1;
    //  Push-pull/open-drain selection on INT1 and INT2 pins. This bit must be set to '0' when H_LACTIVE is set to '1'.
    uint8_t pp_od               : 1;
    //  Interrupt activation level.
    uint8_t h_lactive           : 1;
    //  Block Data Update.
    uint8_t bdu                 : 1;
    //  Reboots memory content.
    uint8_t boot                : 1;
} ism330dhcx_ctrl3_c_t;

typedef enum {
  ISM330DHCX_SPI_4_WIRE = 0,
  ISM330DHCX_SPI_3_WIRE = 1,
} ism330dhcx_sim_t;

typedef enum {
  ISM330DHCX_PUSH_PULL   = 0,
  ISM330DHCX_OPEN_DRAIN  = 1,
} ism330dhcx_pp_od_t;

typedef enum {
  ISM330DHCX_ACTIVE_HIGH = 0,
  ISM330DHCX_ACTIVE_LOW  = 1,
} ism330dhcx_h_lactive_t;

/* Control register 4 */
typedef struct {
    uint8_t reserved0           : 1;
    //  Enables gyroscope digital LPF1; the bandwidth can be selected through FTYPE[2:0] in CTRL6_C (15h).
    uint8_t lpf1_sel_g          : 1;
    //  Disables I²C interface. Default value: 0
    uint8_t i2c_disable         : 1;
    //  Enables data available
    uint8_t drdy_mask           : 1;
    uint8_t reserved1           : 1;
    //  All interrupt signals available on INT1 pin enable. Default value: 0
    uint8_t int2_on_int1        : 1;
    //  Enables gyroscope Sleep mode. Default value:0
    uint8_t sleep_g             : 1;
    uint8_t reserved2           : 1;
} ism330dhcx_ctrl4_c_t;

typedef enum {
  ISM330DHCX_I2C_ENABLE  = 0,
  ISM330DHCX_I2C_DISABLE = 1,
} ism330dhcx_i2c_disable_t;

/* Control register 5 */
typedef struct {
    //  Linear acceleration sensor self-test enable. Default value: 00
    uint8_t st_xl               : 2;
    //  Angular rate sensor self-test enable. Default value: 00
    uint8_t st_g                : 2;
    uint8_t reserved0           : 1;
    //  Circular burst-mode (rounding) read of the output registers. Default value: 00
    uint8_t rounding            : 2;
    uint8_t reserved1           : 1;
} ism330dhcx_ctrl5_c_t;

typedef enum {
  ISM330DHCX_XL_ST_DISABLE  = 0,
  ISM330DHCX_XL_ST_POSITIVE = 1,
  ISM330DHCX_XL_ST_NEGATIVE = 2,
} ism330dhcx_st_xl_t;

typedef enum {
  ISM330DHCX_GY_ST_DISABLE  = 0,
  ISM330DHCX_GY_ST_POSITIVE = 1,
  ISM330DHCX_GY_ST_NEGATIVE = 3,
} ism330dhcx_st_g_t;

typedef enum {
  ISM330DHCX_NO_ROUND      = 0,
  ISM330DHCX_ROUND_XL      = 1,
  ISM330DHCX_ROUND_GY      = 2,
  ISM330DHCX_ROUND_GY_XL   = 3,
} ism330dhcx_rounding_t;

/* Control register 6 */
typedef struct {
    //  Gyroscope low-pass filter (LPF1) bandwidth selection. Table 58 shows the selectable bandwidth values.
    uint8_t ftype               : 3;
    //  Weight of XL user offset bits of registers X_OFS_USR (73h), Y_OFS_USR (74h), Z_OFS_USR (75h)
    uint8_t usr_off_w           : 1;
    //  Disables high-performance operating mode for accelerometer. Default value: 0
    uint8_t xl_hm_mode          : 1;
    //  Enables DEN level-sensitive latched mode. Refer to Table 57.
    uint8_t lvl2_en             : 1;
    //  Enables DEN data level-sensitive trigger mode. Refer to Table 57.
    uint8_t lvl1_en             : 1;
    //  Enables DEN data edge-sensitive trigger mode. Refer to Table 57.
    uint8_t trig_en             : 1;
} ism330dhcx_ctrl6_c_t;

typedef enum {
  ISM330DHCX_ULTRA_LIGHT  = 0,
  ISM330DHCX_VERY_LIGHT   = 1,
  ISM330DHCX_LIGHT        = 2,
  ISM330DHCX_MEDIUM       = 3,
  ISM330DHCX_STRONG       = 4,
  ISM330DHCX_VERY_STRONG  = 5,
  ISM330DHCX_AGGRESSIVE   = 6,
  ISM330DHCX_XTREME       = 7,
} ism330dhcx_ftype_t;

typedef enum {
  ISM330DHCX_LSb_1mg  = 0,
  ISM330DHCX_LSb_16mg = 1,
} ism330dhcx_usr_off_w_t;

typedef enum {
  ISM330DHCX_HIGH_PERFORMANCE_MD  = 0,
  ISM330DHCX_LOW_NORMAL_POWER_MD  = 1,
} ism330dhcx_xl_hm_mode_t;

/* Control register 7 */
typedef struct {
    //  Enables/disables the OIS chain from primary interface when the OIS_ON_EN bit is '1'.
    uint8_t ois_on              : 1;
    //  Enables accelerometer user offset correction block; it's valid for the low-pass path
    uint8_t usr_off_on_out      : 1;
    //  Selects how to enable and disable the OIS chain, after first configuration and enabling through SPI2.
    uint8_t ois_on_en           : 1;
    uint8_t reserved0           : 1;
    //  Gyroscope digital HP filter cutoff selection
    uint8_t hpm_g               : 2;
    //  Enables gyroscope digital high-pass filter. The filter is enabled only if the gyro is in HP mode
    uint8_t hp_en_g             : 1;
    //  Disables high-performance operating mode for gyroscope.
    uint8_t g_hm_mode           : 1;
} ism330dhcx_ctrl7_c_t;

typedef enum {
  ISM330DHCX_AUX_ON                    = 1,
  ISM330DHCX_AUX_ON_BY_AUX_INTERFACE   = 0,
} ism330dhcx_ois_on_t;

typedef enum {
  ISM330DHCX_HP_FILTER_NONE     = 0x00,
  ISM330DHCX_HP_FILTER_16mHz    = 0x80,
  ISM330DHCX_HP_FILTER_65mHz    = 0x81,
  ISM330DHCX_HP_FILTER_260mHz   = 0x82,
  ISM330DHCX_HP_FILTER_1Hz04    = 0x83,
} ism330dhcx_hpm_g_t;

typedef enum {
  ISM330DHCX_GY_HIGH_PERFORMANCE  = 0,
  ISM330DHCX_GY_NORMAL            = 1,
} ism330dhcx_g_hm_mode_t;

/* Control register 8 */
typedef struct {
    //  LPF2 on 6D function selection
    uint8_t low_pass_on_6D      : 1;
    uint8_t reserved0           : 1;
    //  Accelerometer slope filter / high-pass filter selection.
    uint8_t hp_slope_xl_en      : 1;
    //  Enables accelerometer LPF2 and HPF fast-settling mode. The filter sets the second samples after
    //      writing this bit. Active only during device exit from power- down mode.
    uint8_t fastsettl_mode_xl   : 1;
    //  Enables accelerometer high-pass filter reference mode (valid for high-pass path -
    //      HP_SLOPE_XL_EN bit must be ‘1’)
    uint8_t hp_ref_mode_xl      : 1;
    //  Accelerometer LPF2 and HP filter configuration and cutoff setting.
    uint8_t hpcf_xl             : 3;
} ism330dhcx_ctrl8_xl_t;

