life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
typedef enum {
  ISM330DHCX_HP_PATH_DISABLE_ON_OUT    = 0x00,
  ISM330DHCX_SLOPE_ODR_DIV_4           = 0x10,
  ISM330DHCX_HP_ODR_DIV_10             = 0x11,
  ISM330DHCX_HP_ODR_DIV_20             = 0x12,
  ISM330DHCX_HP_ODR_DIV_45             = 0x13,
  ISM330DHCX_HP_ODR_DIV_100            = 0x14,
  ISM330DHCX_HP_ODR_DIV_200            = 0x15,
  ISM330DHCX_HP_ODR_DIV_400            = 0x16,
  ISM330DHCX_HP_ODR_DIV_800            = 0x17,
  ISM330DHCX_HP_REF_MD_ODR_DIV_10      = 0x31,
  ISM330DHCX_HP_REF_MD_ODR_DIV_20      = 0x32,
  ISM330DHCX_HP_REF_MD_ODR_DIV_45      = 0x33,
  ISM330DHCX_HP_REF_MD_ODR_DIV_100     = 0x34,
  ISM330DHCX_HP_REF_MD_ODR_DIV_200     = 0x35,
  ISM330DHCX_HP_REF_MD_ODR_DIV_400     = 0x36,
  ISM330DHCX_HP_REF_MD_ODR_DIV_800     = 0x37,
  ISM330DHCX_LP_ODR_DIV_10             = 0x01,
  ISM330DHCX_LP_ODR_DIV_20             = 0x02,
  ISM330DHCX_LP_ODR_DIV_45             = 0x03,
  ISM330DHCX_LP_ODR_DIV_100            = 0x04,
  ISM330DHCX_LP_ODR_DIV_200            = 0x05,
  ISM330DHCX_LP_ODR_DIV_400            = 0x06,
  ISM330DHCX_LP_ODR_DIV_800            = 0x07,
} ism330dhcx_hp_slope_xl_en_t;

/* Control register 9 */
typedef struct {
    uint8_t reserved0           : 1;
    //  Enables the proper device configuration.
    uint8_t device_conf         : 1;
    //  DEN active level configuration.
    uint8_t den_lh              : 1;
    //  Extends DEN functionality to accelerometer sensor.
    uint8_t den_xl_en           : 1;
    //  DEN stamping sensor selection.
    uint8_t den_xl_g            : 1;
    //  DEN value stored in LSB of Z-axis.
    uint8_t den_z               : 1;
    //  DEN value stored in LSB of Y-axis.
    uint8_t den_y               : 1;
    //  DEN value stored in LSB of X-axis.
    uint8_t den_x               : 1;
} ism330dhcx_ctrl9_xl_t;

typedef enum {
  ISM330DHCX_DEN_ACT_LOW  = 0,
  ISM330DHCX_DEN_ACT_HIGH = 1,
} ism330dhcx_den_lh_t;

typedef enum {
  ISM330DHCX_STAMP_IN_GY_DATA     = 0,
  ISM330DHCX_STAMP_IN_XL_DATA     = 1,
  ISM330DHCX_STAMP_IN_GY_XL_DATA  = 2,
} ism330dhcx_den_xl_g_t;

/* Control register 10 */
typedef struct {
    uint8_t reserved0           : 5;
    //  Enables timestamp counter.
    uint8_t timestamp_en        : 1;
    uint8_t RESERVED1           : 2;
} ism330dhcx_ctrl10_c_t;

/* Source register for all interrupts */
typedef struct {
    //  Free-fall event status.
    uint8_t ff_ia               : 1;
    //  Wake-up event status.
    uint8_t wu_ia               : 1;
    //  Single-tap event status.
    uint8_t single_tap          : 1;
    //  Double-tap event status
    uint8_t double_tap          : 1;
    //  Interrupt active for change in position of portrait, landscape, face-up, face-down.
    uint8_t d6d_ia              : 1;
    //  Detects change event in activity/inactivity status.
    uint8_t sleep_change_ia     : 1;
    uint8_t reserved0           : 1;
    //  Alerts timestamp overflow within 6.4 ms
    uint8_t timestamp_endcount  : 1;
} ism330dhcx_all_int_src_t;

/* Wake-up interrupt source register */
typedef struct {
    //  Wakeup event detection status on Z-axis.
    uint8_t z_wu                : 1;
    //  Wakeup event detection status on Y-axis.
    uint8_t y_wu                : 1;
    //  Wakeup event detection status on X-axis.
    uint8_t x_wu                : 1;
    //  Wakeup event detection status.
    uint8_t wu_ia               : 1;
    //  Sleep event status.
    uint8_t sleep_state         : 1;
    //  Free-fall event detection status.
    uint8_t ff_ia               : 1;
    //  Detects change event in activity/inactivity status.
    uint8_t sleep_change_ia     : 1;
    uint8_t reserved0           : 1;
} ism330dhcx_wake_up_src_t;

/* Tap source register */
typedef struct {
    //  Tap event detection status on Z-axis.
    uint8_t z_tap               : 1;
    //  Tap event detection status on Y-axis.
    uint8_t y_tap               : 1;
    //  Tap event detection status on X-axis.
    uint8_t x_tap               : 1;
    //  Sign of acceleration detected by tap event.
    uint8_t tap_sign            : 1;
    //  Double-tap event detection status.
    uint8_t double_tap          : 1;
    //  Single-tap event status.
    uint8_t single_tap          : 1;
    //  Tap event detection status.
    uint8_t tap_ia              : 1;
    uint8_t reserved0           : 1;
} ism330dhcx_tap_src_t;

/* Portrait, landscape, face-up and face-down source register */
typedef struct {
    //  X-axis low event (under threshold).
    uint8_t xl                  : 1;
    //  X-axis high event (under threshold).
    uint8_t xh                  : 1;
    //  Y-axis low event (under threshold).
    uint8_t yl                  : 1;
    //  Y-axis high event (under threshold).
    uint8_t yh                  : 1;
    //  Z-axis low event (under threshold).
    uint8_t zl                  : 1;
    //  Z-axis high event (under threshold).
    uint8_t zh                  : 1;
    //  Interrupt active for change position portrait, landscape, face-up, face-down.
    uint8_t d6d_ia              : 1;
    //  DEN data-ready signal. It is set high when data output is related to the data coming from a DEN active condition
    uint8_t den_drdy            : 1;
} ism330dhcx_drd_src_t;

/* STATUS_REG register (read by the primary interface I²C/SPI) */
typedef struct {
    //  Accelerometer new data available.
    uint8_t xlda                : 1;
    //  Gyroscope new data available.
    uint8_t gda                 : 1;
    //  Temperature new data available.
    uint8_t tda                 : 1;
    uint8_t reserved0           : 5;
} ism330dhcx_status_reg_t;

/* STATUS_SPIAux register (read by the auxiliary SPI) */
typedef struct {
    //  Accelerometer data available (reset when one of the high parts of the output data is read)
    uint8_t xlda                : 1;
    //  Gyroscope data available (reset when one of the high parts of the output data is read)
    uint8_t gda                 : 1;
    //  High when the gyroscope output is in the settling phase.
    uint8_t gyro_settling       : 1;
    uint8_t reserved0           : 5;
} ism330dhcx_spi_aux_t;

