life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
/*  Temp[15:0]
    Temperature sensor output data
    The value is expressed as two’s complement sign extended on the MSB.
*/
typedef struct {
    uint8_t temp                : 8;
} ism330dhcx_out_temp_l_t;
typedef struct {
    uint8_t temp                : 8;
} ism330dhcx_out_temp_h_t;

/*  OUTX_GYRO[15:0]
    Pitch axis (X) angular rate value
    D[15:0] expressed in two’s complement and its value depends on the interface used:
    SPI1/I²C: Gyro GP chain pitch axis output
    SPI2: Gyro OIS chain pitch axis output
*/
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_outx_l_g_t;
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_outx_h_g_t;

/*  OUTY_GYRO[15:0]
    Roll axis (Y) angular rate value
    D[15:0] expressed in two’s complement and its value depends on the interface used:
    SPI1/I²C: Gyro GP chain roll axis output
    SPI2: Gyro OIS chain roll axis output
*/
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_outy_l_g_t;
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_outy_h_g_t;

/*  OUTZ_GYRO[15:0]
    Yaw axis (Z) angular rate value
    D[15:0] expressed in two’s complement and its value depends on the interface used:
    SPI1/I²C: Gyro GP chain yaw axis output
    SPI2: Gyro OIS chain yaw axis output
*/
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_outz_l_g_t;
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_outz_h_g_t;

/*  OUTX_ACC[15:0]
    X-axis linear acceleration value.
    D[15:0] expressed in two’s complement and its value depends on the interface used:
    SPI1/I²C: Accelerometer GP chain X-axis output
    SPI2: Accelerometer OIS chain X-axis output
*/
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_outx_l_a_t;
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_outx_h_a_t;

/*  OUTY_ACC[15:0]
    Y-axis linear acceleration value
    D[15:0] expressed in two’s complement and its value depends on the interface used:
    SPI1/I²C: Accelerometer GP chain Y-axis output
    SPI2: Accelerometer OIS chain Y-axis output
*/
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_outy_l_a_t;
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_outy_h_a_t;

/*  OUTZ_ACC[15:0]
    Z-axis linear acceleration value
    D[15:0] expressed in two’s complement and its value depends on the interface used:
    SPI1/I²C: Accelerometer GP chain Z-axis output
    SPI2: Accelerometer OIS chain Z-axis output
*/
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_outz_l_a_t;
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_outz_h_a_t;

/*  Embedded function status register */
typedef struct {
    uint8_t reserved0           : 3;
    //  Interrupt status bit for step detection.
    uint8_t is_step_det         : 1;
    //  Interrupt status bit for tilt detection.
    uint8_t is_tilt             : 1;
    //  Interrupt status bit for significant motion detection
    uint8_t is_sigmot           : 1;
    uint8_t reserved1           : 1;
    //  Interrupt status bit for FSM long counter tiemout interrupt event.
    uint8_t is_fsm_lc           : 1;
} ism330dhcx_emb_func_status_mainpage_t;

/*  Finite State Machine status register */
typedef struct {
    uint8_t is_fsm1             : 1;
    uint8_t is_fsm2             : 1;
    uint8_t is_fsm3             : 1;
    uint8_t is_fsm4             : 1;
    uint8_t is_fsm5             : 1;
    uint8_t is_fsm6             : 1;
    uint8_t is_fsm7             : 1;
    uint8_t is_fsm8             : 1;
} ism330dhcx_fsm_status_a_mainpage_t;

/*  Finite State Machine status register */
typedef struct {
    uint8_t is_fsm9             : 1;
    uint8_t is_fsm10            : 1;
    uint8_t is_fsm11            : 1;
    uint8_t is_fsm12            : 1;
    uint8_t is_fsm13            : 1;
    uint8_t is_fsm14            : 1;
    uint8_t is_fsm15            : 1;
    uint8_t is_fsm16            : 1;
} ism330dhcx_fsm_status_b_mainpage_t;

/*  Machine Learning Core status register */
typedef struct {
    uint8_t is_mlc1             : 1;
    uint8_t is_mlc2             : 1;
    uint8_t is_mlc3             : 1;
    uint8_t is_mlc4             : 1;
    uint8_t is_mlc5             : 1;
    uint8_t is_mlc6             : 1;
    uint8_t is_mlc7             : 1;
    uint8_t is_mlc8             : 1;
} ism330dhcx_mlc_status_mainpage_t;

/*  Sensor hub source register */
typedef struct {
    //  Sensor hub communication status
    uint8_t sens_hub_endop      : 1;
    uint8_t reserved0           : 2;
    //  This bit is set to 1 if NACK on slave 0 communicaiton
    uint8_t slave0_nack         : 1;
    //  This bit is set to 1 if NACK on slave 1 communicaiton
    uint8_t slave1_nack         : 1;
    //  This bit is set to 1 if NACK on slave 2 communicaiton
    uint8_t slave2_nack         : 1;
    //  This bit is set to 1 if NACK on slave 3 communicaiton
    uint8_t slave3_nack         : 1;
    //  When the bit WRITE_ONCE in MASTER_CONFIG (14h) is configured as 1,
    //      this bit is set to 1 when the write operation on slave 0 has
    //      been performed and completed.
    uint8_t wr_once_done        : 1;
} ism330dhcx_status_master_mainpage_t;

/*  FIFO status register 1 */
typedef struct {
    // Number of unread sensor data (TAG + 6 bytes) stored in FIFO
    //  In conjunction with DIFF_FIFO[9:8] in FIFO_STATUS2
    uint8_t diff_fifo           : 8;
} ism330dhcx_fifo_status1_t;

/*  FIFO status register 2 */
typedef struct {
    // In conjunction with DIFF_FIFO[0:7] in FIFO_STATUS1
    uint8_t diff_fifo           : 2;
    uint8_t reserved0           : 1;
    // Latched FIFO overrun status.
    uint8_t fifo_ovr_latched    : 1;
    // Counter BDR reaches the CNT_BDR_TH[10:0] threshold set in
    //  COUNTER_BDR_REG1 and COUNTER_BDR_REG2.
    uint8_t counter_bdr_ia      : 1;
    // Smart FIFO full status
    uint8_t fifo_full_ia        : 1;
    // FIFO Overrun status
    uint8_t fifo_ovr_ia         : 1;
    // FIFO Watermark status
    uint8_t fifo_wtm_ia         : 1;
} ism330dhcx_fifo_status2_t;

