life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
/*
    Timestamp first data output register (r).
    The value is expressed as a 32-bit word and the bit resolution is 25 µs.
*/
//  D[0:7]
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_timestamp0_t;
//  D[8:15]
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_timestamp1_t;
//  D[16:23]
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_timestamp2_t;
//  D[24:32]
typedef struct {
    uint8_t d                   : 8;
} ism330dhcx_timestamp3;

/*  Activity/inactivity functions, configuration of filtering, and tap recognition functions */
typedef struct {
    // Latched interrupt
    uint8_t lir                 : 1;
    // Enable Z direction in tap recognition
    uint8_t tap_z_en            : 1;
    // Enable Y direction in tap recognition
    uint8_t tap_y_en            : 1;
    // Enable X direction in tap recognition
    uint8_t tap_x_en            : 1;
    // HPF or SLOPE filter selection on wake-up and Activity/Inactivity functions.
    uint8_t slope_fds           : 1;
    // Activity/inactivity interrupt mode configuration.
    //  If INT1_SLEEP_CHANGE or INT2_SLEEP_CHANGE bits are enabled, drives the sleep status or
    //  sleep change on the INT pins
    uint8_t sleep_status_on_int : 1;
    // This bit allows immediately clearing the latched interrupts of an event detection upon the read of
    //  the corresponding status register. It must be set to 1 together with LIR.
    uint8_t int_clr_on_read     : 1;
    uint8_t reserved0           : 1;
} ism330dhcx_tap_cfg0;

typedef enum {
  ISM330DHCX_ALL_INT_PULSED            = 0,
  ISM330DHCX_BASE_LATCHED_EMB_PULSED   = 1,
  ISM330DHCX_BASE_PULSED_EMB_LATCHED   = 2,
  ISM330DHCX_ALL_INT_LATCHED           = 3,
} ism330dhcx_lir_t;

typedef enum {
  ISM330DHCX_USE_SLOPE = 0,
  ISM330DHCX_USE_HPF   = 1,
} ism330dhcx_slope_fds_t;

typedef enum {
  ISM330DHCX_DRIVE_SLEEP_CHG_EVENT = 0,
  ISM330DHCX_DRIVE_SLEEP_STATUS    = 1,
} ism330dhcx_sleep_status_on_int_t;

/*  Tap configuration register */
typedef struct {
    // X-axis tap recognition threshold.
    uint8_t tap_ths_x           : 5;
    // Selection of axis priority for TAP detection.
    uint8_t tap_priority        : 3;
} ism330dhcx_tap_cfg1_t;

typedef enum {
  ISM330DHCX_XYZ = 0,
  ISM330DHCX_YXZ = 1,
  ISM330DHCX_XZY = 2,
  ISM330DHCX_ZYX = 3,
  ISM330DHCX_YZX = 5,
  ISM330DHCX_ZXY = 6,
} ism330dhcx_tap_priority_t;

/*  Enables interrupt and inactivity functions, and tap recognition functions */
typedef struct {
    // Y-axis tap recofnition threshold.
    uint8_t tap_ths_y           : 5;
    // Enable activity/inactivity (sleep function)
    uint8_t inact_en            : 2;
    // Enable basic interrupts (6D/4D, free-fall, wake-up, tap, inactivity)
    uint8_t interrupts_enable   : 1;
} ism330dhcx_tap_cfg2_t;

typedef enum {
  ISM330DHCX_XL_AND_GY_NOT_AFFECTED      = 0,
  ISM330DHCX_XL_12Hz5_GY_NOT_AFFECTED    = 1,
  ISM330DHCX_XL_12Hz5_GY_SLEEP           = 2,
  ISM330DHCX_XL_12Hz5_GY_PD              = 3,
} ism330dhcx_inact_en_t;

/*  Portrait/landscape position and tap function threshold register */
typedef struct {
    // Z-axis recognition threshold
    uint8_t tap_ths_z           : 5;
    // Threshold for 4D/6D function
    uint8_t sixd_ths            : 2;
    // Enables detection of 4D orientation, Z-axis position detection is disabled.
    uint8_t d4d_en              : 1;
} ism330dhcx_tap_ths_6D_t;

typedef enum {
  ISM330DHCX_DEG_80  = 0,
  ISM330DHCX_DEG_70  = 1,
  ISM330DHCX_DEG_60  = 2,
  ISM330DHCX_DEG_50  = 3,
} ism330dhcx_sixd_ths_t;

/*  Tap recognition function setting register */
typedef struct {
    // Maximum duration of overthreshold event
    uint8_t shock               : 2;
    // Expected quiet time after a tap detection
    uint8_t quiet               : 2;
    // Duration of maximum time gap for double-tap recognition
    uint8_t dur                 : 4;
} ism330dhcx_int_dur2_t;

/*  Single/double-tap selection and wake-up configuration */
typedef struct {
    // Threshold for wakeup (1LSB weight depends on WAKE_THS_W in WAKE_UP_DUR)
    uint8_t wk_ths              : 6;
    // Sends the low pass filtered data with user offset correction to the wake up funcion
    uint8_t usr_off_on_wu       : 1;
    // Single/double-tap event enable
    uint8_t single_double_tap   : 1;
} ism330dhcx_wake_up_ths_t;

typedef enum {
  ISM330DHCX_ONLY_SINGLE        = 0,
  ISM330DHCX_BOTH_SINGLE_DOUBLE = 1,
} ism330dhcx_single_double_tap_t;

/*  Free-fall, wakeup and sleep mode functions duration setting register */
typedef struct {
    // Duration to go in sleep mode
    uint8_t sleep_dur           : 4;
    // Weight of 1 LSB of wakeup threshold
    uint8_t wake_ths_w          : 1;
    // Wake up duration event
    uint8_t wake_dur            : 2;
    // Free fall duration event
    uint8_t ff_dur5             : 1;
} ism330dhcx_wake_up_dur_t;

typedef enum {
  ISM330DHCX_LSb_FS_DIV_64       = 0,
  ISM330DHCX_LSb_FS_DIV_256      = 1,
} ism330dhcx_wake_ths_w_t;

/*  Free-fall function duration setting register */
typedef struct {
    // Free-fall threshold setting
    uint8_t ff_ths              : 3;
    // Free-fall duration event
    //  For the complete configuration of the free fall duration, refer to FF_DUR5 in WAKE_UP_DUR (5Ch)
    //  configuration.
    uint8_t ff_dur              : 5;
} ism330dhcx_free_fall_t;

typedef enum {
  ISM330DHCX_FF_TSH_156mg = 0,
  ISM330DHCX_FF_TSH_219mg = 1,
  ISM330DHCX_FF_TSH_250mg = 2,
  ISM330DHCX_FF_TSH_312mg = 3,
  ISM330DHCX_FF_TSH_344mg = 4,
  ISM330DHCX_FF_TSH_406mg = 5,
  ISM330DHCX_FF_TSH_469mg = 6,
  ISM330DHCX_FF_TSH_500mg = 7,
} ism330dhcx_ff_ths_t;

/*  Functions routing on INT1 register */
typedef struct {
    //  Routing of sensor hub communication concluded event on INT1.
    uint8_t int1_shub           : 1;
    // Routing of embedded functions event on INT1
    uint8_t int1_emb_func       : 1;
    // Routing of 6D event on INT1
    uint8_t int1_6d;
    // Routing of tap event on INT1
    uint8_t int1_double_tap     : 1;
    // Routing of free-fall event on INT1
    uint8_t int1_ff             : 1;
    // Routing of wakeup event on INT1
    uint8_t int1_wu             : 1;
    // Routing of single-tap recognition event on INT1
    uint8_t int1_single_tap     : 1;
    // Routing of activity/inactivity recognition on INT1
    uint8_t int1_sleep_change   : 1;
} ism330dhcx_md1_cfg_t;

