life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
/*  Functions routing on INT2 register */
typedef struct {
    //  Enables routing on INT2 pin of the alert for timestamp overflow within 6.4 ms.
    uint8_t int2_timestamp      : 1;
    // Routing of embedded functions event on INT2
    uint8_t int2_emb_func       : 1;
    // Routing of 6D event on INT1
    uint8_t int2_6d;
    // Routing of tap event on INT1
    uint8_t int2_double_tap     : 1;
    // Routing of free-fall event on INT1
    uint8_t int2_ff             : 1;
    // Routing of wakeup event on INT1
    uint8_t int2_wu             : 1;
    // Routing of single-tap recognition event on INT1
    uint8_t int2_single_tap     : 1;
    // Routing of activity/inactivity recognition on INT1
    uint8_t int2_sleep_change   : 1;
} ism330dhcx_md2_cfg_t;

/*  Internal frequency register */
typedef struct {
    // Difference in percentage of the effective ODR (and timestamp rate)
    //  with respect to the typical step (0.15%).
    //  8-bit format, 2's complement.
    uint8_t freq_fine           : 8;
} ism330dhcx_internal_freq_fine_t;

/*  OIS interrupt configuration register and accelerometer self-test enable setting.
    Primary interface for read-only (r);
    only Aux SPI can write to this register
*/
typedef struct {
    // Selects accelerometer self-test
    //  effective only if XL OIS chain is enabled
    uint8_t st_xl_ois           : 2;
    uint8_t reserved0           : 3;
    // Indicates polarity of DEN signal on OIS chain.
    uint8_t den_lh_ois          : 1;
    // Enables level-sensitive latched mode on the OIS chain.
    uint8_t lvl2_ois            : 1;
    // Enables OIS chain DRDY on INT2 pin. This setting has priority over all other INT2 settings.
    uint8_t int2_drdy_ois       : 1;
} ism330dhcx_int_ois_t;

typedef enum {
  ISM330DHCX_AUX_XL_DISABLE = 0,
  ISM330DHCX_AUX_XL_POS     = 1,
  ISM330DHCX_AUX_XL_NEG     = 2,
} ism330dhcx_st_xl_ois_t;

typedef enum {
  ISM330DHCX_AUX_DEN_ACTIVE_LOW     = 0,
  ISM330DHCX_AUX_DEN_ACTIVE_HIGH    = 1,
} ism330dhcx_den_lh_ois_t;

typedef enum {
  ISM330DHCX_AUX_DEN_DISABLE         = 0,
  ISM330DHCX_AUX_DEN_LEVEL_TRIG      = 2,
  ISM330DHCX_AUX_DEN_LEVEL_LATCH     = 3,
} ism330dhcx_lvl2_ois_t;

/*
    OIS configuration register.
    Primary interface for read-only (r);
    only Aux SPI can write to this register (r/w).
*/
typedef struct {
    // Enables OIS chain data processing for gyro in Mode 3 and Mode 4 (mode4_en = 1) and accelerometer data in Mode 4 (mode4_en = 1).
    //  When the OIS chain is enabled, the OIS outputs are available through the SPI2 in registers OUTX_L_G
    //      (22h) and OUTX_H_G (23h) through OUTZ_L_A (2Ch) and OUTZ_H_A (2Dh) and STATUS_REG (1Eh) /
    //      STATUS_SPIAux (1Eh), and LPF1 is dedicated to this chain.
    uint8_t ois_en_spi2         : 1;
    // Selects gyroscope OIS chain full-scale +/- 125 dps.
    uint8_t fs_125_ois          : 1;
    // Selects gyroscope OIS chain full-sclae
    uint8_t fs_g_ois            : 2;
    // Enables accelerometer OIS chain. OIS outputs are available through SPI2
    //  in registers OUTX_L_A and OUTX_H_A or OUT_Z_L_A and OUT_Z_H_A
    uint8_t mode4_en            : 1;
    // Select SPI wire interface (3 or 4)
    uint8_t sim_ois             : 1;
    // Enables level-sensitive trigge mode on OIS chain
    uint8_t lvl1_ois            : 1;
    uint8_t reserved0           : 1;
} ism330dhcx_ctrl1_ois_t;

typedef enum {
  ISM330DHCX_AUX_DISABLE  = 0,
  ISM330DHCX_MODE_3_GY    = 1,
  ISM330DHCX_MODE_4_GY_XL = 3,
} ism330dhcx_ois_en_spi2_t;

typedef enum {
  ISM330DHCX_125dps_AUX  =  0x04,
  ISM330DHCX_250dps_AUX  =  0x00,
  ISM330DHCX_500dps_AUX  =  0x01,
  ISM330DHCX_1000dps_AUX =  0x02,
  ISM330DHCX_2000dps_AUX =  0x03,
} ism330dhcx_fs_g_ois_t;

typedef enum {
    ISM330DHCX_AUX_SPI_4_WIRE = 0,
    ISM330DHCX_AUX_SPI_3_WIRE = 1,
} ism330dhcx_sim_ois_t;

//< DEN mode selection can be done using the LVL1_OIS bit
//  of register CTRL1_OIS (70h) and the LVL2_OIS bit of
//  register INT_OIS (6Fh).
typedef enum {                          // LV1_OIS  LV2_OIS
  ISM330DHCX_DEN_DISABLE    = 0,        //      0    0
  ISM330DHCX_LEVEL_FIFO     = 6,        //      0
  ISM330DHCX_LEVEL_LETCHED  = 3,        //      1
  ISM330DHCX_LEVEL_TRIGGER  = 2,        //      0
  ISM330DHCX_EDGE_TRIGGER   = 4,        //      0
} ism330dhcx_den_mode_t;

/*
    OIS configuration register.
*/
typedef struct {
    // Enables gyroscope OIS chain digital high-pass filter
    uint8_t hp_en_ois           : 1;
    // Selects gyroscope digital LPFA filter bandwith.
    uint8_t ftype_ois           : 2;
    uint8_t reserved0           : 1;
    // Selects gyroscope OIS chain digital high-pass filter cutoff.
    uint8_t hpm_ois             : 2;
    uint8_t reserved1           : 2;
} ism330dhcx_ctrl2_ois_t;

typedef enum {
  ISM330DHCX_351Hz39 = 0,
  ISM330DHCX_236Hz63 = 1,
  ISM330DHCX_172Hz70 = 2,
  ISM330DHCX_937Hz91 = 3,
} ism330dhcx_ftype_ois_t;

typedef enum {
  ISM330DHCX_AUX_HP_DISABLE = 0x00,
  ISM330DHCX_AUX_HP_Hz016   = 0x10,
  ISM330DHCX_AUX_HP_Hz065   = 0x11,
  ISM330DHCX_AUX_HP_Hz260   = 0x12,
  ISM330DHCX_AUX_HP_1Hz040  = 0x13,
} ism330dhcx_hpm_ois_t;

/*
    OIS configuration register.
*/
typedef struct {
    // Disables OIS chain clamp
    uint8_t st_ois_clampdis     : 1;
    // Selects gyroscope OIS chain self-test
    uint8_t st_ois              : 2;
    // Selects accelerometer OIS channel bandwith
    uint8_t filter_xl_conf_ois  : 3;
    // Selects accelerometer OIS channel full-scale
    uint8_t fs_xl_ois           : 2;
} ism330dhcx_ctrl3_ois_t;

typedef enum {
  ISM330DHCX_ENABLE_CLAMP  = 0,
  ISM330DHCX_DISABLE_CLAMP = 1,
} ism330dhcx_st_ois_clampdis_t;

typedef enum {
  ISM330DHCX_AUX_GY_DISABLE = 0,
  ISM330DHCX_AUX_GY_POS     = 1,
  ISM330DHCX_AUX_GY_NEG     = 3,
} ism330dhcx_st_ois_t;

typedef enum {
  ISM330DHCX_631Hz = 0,
  ISM330DHCX_295Hz = 1,
  ISM330DHCX_140Hz = 2,
  ISM330DHCX_68Hz2 = 3,
  ISM330DHCX_33Hz6 = 4,
  ISM330DHCX_16Hz7 = 5,
  ISM330DHCX_8Hz3  = 6,
  ISM330DHCX_4Hz11 = 7,
} ism330dhcx_filter_xl_conf_ois_t;

