life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
typedef enum {
  ISM330DHCX_AUX_2g  = 0,
  ISM330DHCX_AUX_16g = 1,
  ISM330DHCX_AUX_4g  = 2,
  ISM330DHCX_AUX_8g  = 3,
} ism330dhcx_fs_xl_ois_t;

/*
    ²Accelerometer axis user offset correction (r/w).
    The offset value set in the OFS_USR offset register is
    internally subtracted from the acceleration value measured on the axis.

    Accelerometer axis user offset correction expressed in two’s complement, weight depends on
    USR_OFF_W in CTRL6_C (15h). The value must be in the range [-127 127].
*/
typedef struct {
    uint8_t x_ofs_usr           : 8;
} ism330dhcx_x_ofs_usr_t;
typedef struct {
    uint8_t y_ofs_usr           : 8;
} ism330dhcx_y_ofs_usr_t;
typedef struct {
    uint8_t z_ofs_usr           : 8;
} ism330dhcx_z_ofs_usr_t;

/*  FIFO Tag register */
typedef struct {
    // Parity check of TAG content
    uint8_t tag_parity          : 1;
    // 2-bit counter wich identifies sensor time slot
    uint8_t tag_cnt              : 2;
    // Identifies the sensor in all FIFO_DATA_OUT_ registers.
    // Voir table suivante
    uint8_t tag_sensor          : 5;
} ism330dhcx_fifo_data_out_tag_t;

typedef enum {
  ISM330DHCX_GYRO_NC_TAG    = 1,
  ISM330DHCX_XL_NC_TAG,
  ISM330DHCX_TEMPERATURE_TAG,
  ISM330DHCX_TIMESTAMP_TAG,
  ISM330DHCX_CFG_CHANGE_TAG,
  ISM330DHCX_XL_NC_T_2_TAG,
  ISM330DHCX_XL_NC_T_1_TAG,
  ISM330DHCX_XL_2XC_TAG,
  ISM330DHCX_XL_3XC_TAG,
  ISM330DHCX_GYRO_NC_T_2_TAG,
  ISM330DHCX_GYRO_NC_T_1_TAG,
  ISM330DHCX_GYRO_2XC_TAG,
  ISM330DHCX_GYRO_3XC_TAG,
  ISM330DHCX_SENSORHUB_SLAVE0_TAG,
  ISM330DHCX_SENSORHUB_SLAVE1_TAG,
  ISM330DHCX_SENSORHUB_SLAVE2_TAG,
  ISM330DHCX_SENSORHUB_SLAVE3_TAG,
  ISM330DHCX_STEP_CPUNTER_TAG,
  ISM330DHCX_GAME_ROTATION_TAG,
  ISM330DHCX_GEOMAG_ROTATION_TAG,
  ISM330DHCX_ROTATION_TAG,
  ISM330DHCX_SENSORHUB_NACK_TAG = 0x19,
} ism330dhcx_fifo_tag_t;

/*  FIFO data output X */
typedef struct {
    // [D0-D7]
    uint8_t d                   : 8;
} ism330dhcx_fifo_data_out_x_l_t;
typedef struct {
    // [D8-D15]
    uint8_t d                   : 8;
} ism330dhcx_fifo_data_out_x_h_t;

/*  FIFO data output Y */
typedef struct {
    // [D0-D7]
    uint8_t d                   : 8;
} ism330dhcx_fifo_data_out_y_l_t;
typedef struct {
    // [D8-D15]
    uint8_t d                   : 8;
} ism330dhcx_fifo_data_out_y_h_t;

/*  FIFO data output Z */
typedef struct {
    // [D0-D7]
    uint8_t d                   : 8;
} ism330dhcx_fifo_data_out_z_l_t;
typedef struct {
    // [D8-D15]
    uint8_t d                   : 8;
} ism330dhcx_fifo_data_out_z_h_t;

/***************** Embeded functions registers *************/

/*  Enable advanced features dedicated page */
typedef struct {
    uint8_t reserved0           : 1;        // Must be set to '1'
    uint8_t reserved1           : 3;
    // Select the advanced features dedicated page
    uint8_t page_sel            : 4;
} ism330dhcx_page_sel_t;

/* Embedded functions enable register */
typedef struct {
    uint8_t reserved0           : 3;
    // Enable pedometer algorithm.
    uint8_t pedo_en             : 1;
    // Enable tilt calculation.
    uint8_t tilt_en             : 1;
    // Enable significant motion detection function.
    uint8_t sign_motion_en      : 1;
    uint8_t reserved1           : 2;
} ism330dhcx_emb_func_en_a_t;

/* Embedded functions enable register */
typedef struct {
    // Enable Finite State Machine (FSM) feature.
    uint8_t fsm_en              : 1;
    uint8_t reserved0           : 2;
    // Enable FIFO compression feature.
    uint8_t fifo_compr_en       : 1;
    // Enable Machine Learning Core feature.
    uint8_t mlc_en              : 1;
    uint8_t reserved1           : 3;
} ism330dhcx_emb_func_en_b_t;

/* Page adress register */
typedef struct {
/*
    After setting the bit PAGE_WRITE / PAGE_READ in register PAGE_RW (17h),
    this register is used to set the address of the register to be written/read
    in the advanced features page selected through the bits PAGE_SEL[3:0]
    in register PAGE_SEL (02h).
*/
    uint8_t page_addr           : 8;
} ism330dhcx_page_adress_t;

/* Page value register */
typedef struct {
/*
    These bits are used to write
    (if the bit PAGE_WRITE = 1 in register PAGE_RW (17h))
    or read
    (if the bit PAGE_READ = 1 in register PAGE_RW (17h))
    the data at the address PAGE_ADDR[7:0] of the selected
    advanced features page.
*/
    uint8_t page_value          : 8;
} ism330dhcx_page_value_t;

/* INT1 pin control register */
typedef struct {
    uint8_t reserved0           : 3;
    // Routing of pedometer step recognition event on INT1.
    uint8_t int1_step_detector  : 1;
    // Routing of tilt event on INT1.
    uint8_t int1_tilt           : 1;
    // Routing of significant motion event on INT1.
    uint8_t int1_sig_mot        : 1;
    uint8_t reserved1           : 1;
    // Routing of FSM long counter timeout interrupt event on INT1.
    uint8_t int1_fsm_lc         : 1;
} ism330dhcx_emb_func_int1_t;

/*  INT1 pin control register
    Routing of FSMX interrupt event on INT1. */
typedef struct {
    uint8_t int1_fsm1           : 1;
    uint8_t int1_fsm2           : 1;
    uint8_t int1_fsm3           : 1;
    uint8_t int1_fsm4           : 1;
    uint8_t int1_fsm5           : 1;
    uint8_t int1_fsm6           : 1;
    uint8_t int1_fsm7           : 1;
    uint8_t int1_fsm8           : 1;
} ism330dhcx_fsm_int1_a_t;

/*  INT1 pin control register
    Routing of FSMX interrupt event on INT1. */
typedef struct {
    uint8_t int1_fsm9           : 1;
    uint8_t int1_fsm10          : 1;
    uint8_t int1_fsm11          : 1;
    uint8_t int1_fsm12          : 1;
    uint8_t int1_fsm13          : 1;
    uint8_t int1_fsm14          : 1;
    uint8_t int1_fsm15          : 1;
    uint8_t int1_fsm16          : 1;
} ism330dhcx_fsm_int1_b_t;

/*  INT1 pin control register
    Routing of MLCX interrupt event on INT1  */
typedef struct {
    uint8_t int1_mlc1           : 1;
    uint8_t int1_mlc2           : 1;
    uint8_t int1_mlc3           : 1;
    uint8_t int1_mlc4           : 1;
    uint8_t int1_mlc5           : 1;
    uint8_t int1_mlc6           : 1;
    uint8_t int1_mlc7           : 1;
    uint8_t int1_mlc8           : 1;
} ism330dhcx_mlc_int1_t;

/* INT2 pin control register */
typedef struct {
    uint8_t reserved0           : 3;
    // Routing of pedometer step recognition event on INT2.
    uint8_t int2_step_detector  : 1;
    // Routing of tilt event on INT2.
    uint8_t int2_tilt           : 1;
    // Routing of significant motion event on INT2.
    uint8_t int2_sig_mot        : 1;
    uint8_t reserved1           : 1;
    // Routing of FSM long counter timeout interrupt event on INT2.
    uint8_t int2_fsm_lc         : 1;
} ism330dhcx_emb_func_int2_t;

/*  INT2 pin control register
    Routing of FSMX interrupt event on INT2. */
typedef struct {
    uint8_t int2_fsm1           : 1;
    uint8_t int2_fsm2           : 1;
    uint8_t int2_fsm3           : 1;
    uint8_t int2_fsm4           : 1;
    uint8_t int2_fsm5           : 1;
    uint8_t int2_fsm6           : 1;
    uint8_t int2_fsm7           : 1;
    uint8_t int2_fsm8           : 1;
} ism330dhcx_fsm_int2_a_t;

/*  INT2 pin control register
    Routing of FSMX interrupt event on INT2. */
typedef struct {
    uint8_t int2_fsm9           : 1;
    uint8_t int2_fsm10          : 1;
    uint8_t int2_fsm11          : 1;
    uint8_t int2_fsm12          : 1;
    uint8_t int2_fsm13          : 1;
    uint8_t int2_fsm14          : 1;
    uint8_t int2_fsm15          : 1;
    uint8_t int2_fsm16          : 1;
} ism330dhcx_fsm_int2_b_t;

/*  INT2 pin control register
    Routing of MLCX interrupt event on INT2  */
typedef struct {
    uint8_t int2_mlc1           : 1;
    uint8_t int2_mlc2           : 1;
    uint8_t int2_mlc3           : 1;
    uint8_t int2_mlc4           : 1;
    uint8_t int2_mlc5           : 1;
    uint8_t int2_mlc6           : 1;
    uint8_t int2_mlc7           : 1;
    uint8_t int2_mlc8           : 1;
} ism330dhcx_mlc_int2_t;

