life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
/* Embedded function status register */
typedef struct {
    uint8_t reserved0           : 3;
    // Interrupt status bit for step detection
    uint8_t is_step_det         : 1;
    // Interrupt status bit for tilt detection
    uint8_t is_tilt             : 1;
    // Interrupt status bit for significant motion detection
    uint8_t is_sigmot           : 1;
    uint8_t reserved1           : 1;
    // Interrupt status bit for FSM long counter timeout interrupt event.
    uint8_t is_fsm_lc           : 1;
} ism330dhcx_emb_func_status_t;

/*  Finite State Machine status register
    Interrupt status bit for FSM interrupt event. */
typedef struct {
    uint8_t is_fsm1             : 1;
    uint8_t is_fsm2             : 1;
    uint8_t is_fsm3             : 1;
    uint8_t is_fsm4             : 1;
    uint8_t is_fsm5             : 1;
    uint8_t is_fsm6             : 1;
    uint8_t is_fsm7             : 1;
    uint8_t is_fsm8             : 1;
} ism330dhcx_fsm_status_a_t;
/*  Finite State Machine status register */
typedef struct {
    uint8_t is_fsm9             : 1;
    uint8_t is_fsm10            : 1;
    uint8_t is_fsm11            : 1;
    uint8_t is_fsm12            : 1;
    uint8_t is_fsm13            : 1;
    uint8_t is_fsm14            : 1;
    uint8_t is_fsm15            : 1;
    uint8_t is_fsm16            : 1;
} ism330dhcx_fsm_status_b_t;

/*  Machine Learning Core status register
    Interrupt status bit for MLC interrupt event. */
typedef struct {
    uint8_t is_mlc1             : 1;
    uint8_t is_mlc2             : 1;
    uint8_t is_mlc3             : 1;
    uint8_t is_mlc4             : 1;
    uint8_t is_mlc5             : 1;
    uint8_t is_mlc6             : 1;
    uint8_t is_mlc7             : 1;
    uint8_t is_mlc8             : 1;
} ism330dhcx_mlc_status_t;

/*  Enable read and write mode of advanced features dedicated page */
typedef struct {
    uint8_t reserved0           : 5;
    // Enable reads from the selected advanced features dedicated page.
    uint8_t page_read           : 1;
    // Enable writes to the selected advanced features dedicated page.
    uint8_t page_write          : 1;
    // Latched Interrupt mode for Embedded Functions.
    uint8_t emb_func_lir        : 1;
} ism330dhcx_page_rw_t;

/* Embedded functions batching configuration register */
typedef struct {
    uint8_t reserved0           : 6;
    // Enable FIFO batching of step counter values.
    uint8_t pedo_fifo_en        : 1;
    uint8_t reserved1           : 1;
} ism330dhcx_emb_func_fifo_cfg_t;

/* FSM enable register */
typedef struct {
    uint8_t fsm1_en             : 1;
    uint8_t fsm2_en             : 1;
    uint8_t fsm3_en             : 1;
    uint8_t fsm4_en             : 1;
    uint8_t fsm5_en             : 1;
    uint8_t fsm6_en             : 1;
    uint8_t fsm7_en             : 1;
    uint8_t fsm8_en             : 1;
} ism330dhcx_fsm_enable_a_t;
/* FSM enable register */
typedef struct {
    uint8_t fsm9_en             : 1;
    uint8_t fsm10_en            : 1;
    uint8_t fsm11_en            : 1;
    uint8_t fsm12_en            : 1;
    uint8_t fsm13_en            : 1;
    uint8_t fsm14_en            : 1;
    uint8_t fsm15_en            : 1;
    uint8_t fsm16_en            : 1;
} ism330dhcx_fsm_enable_b_t;

typedef struct {
	ism330dhcx_fsm_enable_a_t     fsm_enable_a;
	ism330dhcx_fsm_enable_b_t     fsm_enable_b;
} ism330dhcx_emb_fsm_enable_t;

/* FSM long counter status register
    Long counter value is an unsigned integer value (16-bit format);
    this value can be reset using the LC_CLEAR bit
    in FSM_LONG_COUNTER_CLEAR (4Ah) register.   */
typedef struct {
    uint8_t fsm_lc_0            : 1;
    uint8_t fsm_lc_1            : 1;
    uint8_t fsm_lc_2            : 1;
    uint8_t fsm_lc_3            : 1;
    uint8_t fsm_lc_4            : 1;
    uint8_t fsm_lc_5            : 1;
    uint8_t fsm_lc_6            : 1;
    uint8_t fsm_lc_7            : 1;
} ism330dhcx_fsm_long_counter_l_t;
typedef struct {
    uint8_t fsm_lc_8            : 1;
    uint8_t fsm_lc_9            : 1;
    uint8_t fsm_lc_10           : 1;
    uint8_t fsm_lc_11           : 1;
    uint8_t fsm_lc_12           : 1;
    uint8_t fsm_lc_13           : 1;
    uint8_t fsm_lc_14           : 1;
    uint8_t fsm_lc_15           : 1;
} ism330dhcx_fsm_long_counter_h_t;

/*  FSM long counter reset register */
typedef struct {
    // Clear FSM long counter value.
    uint8_t fsm_lc_clear        : 1;
    // This read-only bit is automatically set to 1 when the long counter reset is done.
    uint8_t fsm_lc_cleared      : 1;
} ism330dhcx_fsm_long_counter_clear_t;

/*  FSM1 output register */
typedef struct {
    // FSM1 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM1 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM1 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM1 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM1 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM1 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM1 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM1 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs1_t;

/* FSM2 output register */
typedef struct {
    // FSM2 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM2 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM2 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM2 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM2 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM2 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM2 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM2 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs2_t;

/* FSM3 output register */
typedef struct {
    // FSM3 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM3 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM3 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM3 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM3 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM3 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM3 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM3 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs3_t;

/* FSM4 output register */
typedef struct {
    // FSM4 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM4 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM4 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM4 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM4 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM4 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM4 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM4 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs4_t;

