life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
/* FSM5 output register */
typedef struct {
    // FSM5 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM5 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM5 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM5 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM5 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM5 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM5 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM5 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs5_t;

/* FSM6 output register */
typedef struct {
    // FSM6 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM6 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM6 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM6 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM6 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM6 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM6 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM6 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs6_t;

/* FSM7 output register */
typedef struct {
    // FSM7 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM7 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM7 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM7 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM7 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM7 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM7 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM7 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs7_t;

/* FSM8 output register */
typedef struct {
    // FSM8 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM8 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM8 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM8 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM8 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM8 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM8 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM8 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs8_t;

/* FSM9 output register */
typedef struct {
    // FSM9 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM9 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM9 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM9 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM9 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM9 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM9 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM9 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs9_t;

/* FSM10 output register */
typedef struct {
    // FSM10 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM10 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM10 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM10 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM10 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM10 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM10 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM10 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs10_t;

/* FSM11 output register */
typedef struct {
    // FSM11 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM11 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM11 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM11 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM11 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM11 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM11 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM11 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs11_t;

/* FSM12 output register */
typedef struct {
    // FSM12 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM12 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM12 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM12 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM12 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM12 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM12 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM12 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs12_t;

