life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
/* FSM13 output register */
typedef struct {
    // FSM13 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM13 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM13 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM13 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM13 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM13 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM13 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM13 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs13_t;

/* FSM14 output register */
typedef struct {
    // FSM14 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM14 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM14 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM14 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM14 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM14 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM14 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM14 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs14_t;

/* FSM15 output register */
typedef struct {
    // FSM15 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM15 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM15 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM15 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM15 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM15 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM15 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM15 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs15_t;

/* FSM16 output register */
typedef struct {
    // FSM16 output: negative event detected on the vector
    uint8_t n_v                 : 1;
    // FSM16 output: positive event detected on the vector
    uint8_t p_v                 : 1;
    // FSM16 output: negative event detected on the Z-axis
    uint8_t n_z                 : 1;
    // FSM16 output: positive event detected on the Z-axis
    uint8_t p_z                 : 1;
    // FSM16 output: negative event detected on the Y-axis
    uint8_t n_y                 : 1;
    // FSM16 output: positive event detected on the Y-axis
    uint8_t p_y                 : 1;
    // FSM16 output: negative event detected on the X-axis
    uint8_t n_x                 : 1;
    // FSM16 output: positive event detected on the X-axis
    uint8_t p_x                 : 1;
} ism330dhcx_fsm_outs16_t;

/*  Finite State Machine output data rate configuration register */
typedef struct {
    uint8_t reserved0           : 2;    // '1'
    uint8_t reserved1           : 1;
    // Finite State Machine ODR configuration (voir ism330dhcx_fsm_odr_t)
    uint8_t fsm_odr             : 2;
    uint8_t reserved2           : 2;
} ism330dhcx_emb_func_odr_cfg_b_t;

typedef enum {
  ISM330DHCX_ODR_FSM_12Hz5 = 0,
  ISM330DHCX_ODR_FSM_26Hz  = 1,
  ISM330DHCX_ODR_FSM_52Hz  = 2,
  ISM330DHCX_ODR_FSM_104Hz = 3,
} ism330dhcx_fsm_odr_t;

/*  Machine Learning Core output data rate configuration register */
typedef struct {
    uint8_t reserved0           : 1;    // '1'
    uint8_t reserved1           : 1;
    uint8_t reserved2           : 1;    // '1'
    uint8_t reserved3           : 1;
    // Machine Learning Core ODR configuration (voir ism330dhcx_mlc_odr_t)
    uint8_t mlc_odr             : 2;
    uint8_t reserved4           : 2;
} ism330dhcx_emb_func_odr_cfg_c_t;

typedef enum {
  ISM330DHCX_ODR_PRGS_12Hz5 = 0,
  ISM330DHCX_ODR_PRGS_26Hz  = 1,
  ISM330DHCX_ODR_PRGS_52Hz  = 2,
  ISM330DHCX_ODR_PRGS_104Hz = 3,
} ism330dhcx_mlc_odr_t;

/* Step counter output register
    Step counter output */
typedef struct {
    // STEP[0:7]
    uint8_t step0               : 1;
    uint8_t step1               : 1;
    uint8_t step2               : 1;
    uint8_t step3               : 1;
    uint8_t step4               : 1;
    uint8_t step5               : 1;
    uint8_t step6               : 1;
    uint8_t step7               : 1;
} ism330dhcx_step_counter_l_t;
typedef struct {
    // STEP[8:15]
    uint8_t step8               : 1;
    uint8_t step9               : 1;
    uint8_t step10              : 1;
    uint8_t step11              : 1;
    uint8_t step12              : 1;
    uint8_t step13              : 1;
    uint8_t step14              : 1;
    uint8_t step15              : 1;
} ism330dhcx_step_counter_h_t;

/* Embedded function source register */
typedef struct {
    uint8_t reserved0           : 1;
    // This bit is equal to 1 when the step count is increased. Read-only bit.
    uint8_t stepcounter_bit_set : 1;
    // Step counter overflow status. Read-only bit.
    uint8_t step_overflow       : 1;
    // Pedometer step recognition on delta time status. Read-only bit.
    uint8_t step_count_delta_ia : 1;
    // Step detector event detection status. Read-only bit.
    uint8_t step_detected       : 1;
    uint8_t reserved1           : 1;
    // Reset pedometer step counter. Read/write bit.
    uint8_t pedo_rst_step       : 1;
} ism330dhcx_emb_func_src_t;

/*  Embedded functions initialization register */
typedef struct {
    uint8_t reserved0           : 1;
    // Pedometer Step Counter/Detector algorithm initialization request.
    uint8_t step_det_init       : 1;
    // Tilt algorithm initialization request.
    uint8_t tilt_init           : 1;
    // Significant Motion Detection algorithm initialization request.
    uint8_t sig_mot_init        : 1;
    uint8_t reserved1           : 1;
} ism330dhcx_emb_func_init_a_t;

/*  Embedded functions initialization register */
typedef struct {
    // FSM initialization request
    uint8_t fsm_init            : 1;
    uint8_t reserved0           : 2;
    // FIFO compression feature initialization request
    uint8_t fifo_compr_init     : 1;
    // Machine learning core initialization request
    uint8_t mlc_init            : 1;
    uint8_t reserved1           : 3;
} ism330dhcx_emb_func_init_b_t;

/*  Machine Learning Core source register */
typedef struct {
    uint8_t mlc0_src_0          : 1;
    uint8_t mlc0_src_1          : 1;
    uint8_t mlc0_src_2          : 1;
    uint8_t mlc0_src_3          : 1;
    uint8_t mlc0_src_4          : 1;
    uint8_t mlc0_src_5          : 1;
    uint8_t mlc0_src_6          : 1;
    uint8_t mlc0_src_7          : 1;
} ism330dhcx_mlc0_src_t;
