life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
typedef struct {
    uint8_t mlc1_src_0          : 1;
    uint8_t mlc1_src_1          : 1;
    uint8_t mlc1_src_2          : 1;
    uint8_t mlc1_src_3          : 1;
    uint8_t mlc1_src_4          : 1;
    uint8_t mlc1_src_5          : 1;
    uint8_t mlc1_src_6          : 1;
    uint8_t mlc1_src_7          : 1;
} ism330dhcx_mlc1_src_t;
typedef struct {
    uint8_t mlc2_src_0          : 1;
    uint8_t mlc2_src_1          : 1;
    uint8_t mlc2_src_2          : 1;
    uint8_t mlc2_src_3          : 1;
    uint8_t mlc2_src_4          : 1;
    uint8_t mlc2_src_5          : 1;
    uint8_t mlc2_src_6          : 1;
    uint8_t mlc2_src_7          : 1;
} ism330dhcx_mlc2_src_t;
typedef struct {
    uint8_t mlc3_src_0          : 1;
    uint8_t mlc3_src_1          : 1;
    uint8_t mlc3_src_2          : 1;
    uint8_t mlc3_src_3          : 1;
    uint8_t mlc3_src_4          : 1;
    uint8_t mlc3_src_5          : 1;
    uint8_t mlc3_src_6          : 1;
    uint8_t mlc3_src_7          : 1;
} ism330dhcx_mlc3_src_t;
typedef struct {
    uint8_t mlc4_src_0          : 1;
    uint8_t mlc4_src_1          : 1;
    uint8_t mlc4_src_2          : 1;
    uint8_t mlc4_src_3          : 1;
    uint8_t mlc4_src_4          : 1;
    uint8_t mlc4_src_5          : 1;
    uint8_t mlc4_src_6          : 1;
    uint8_t mlc4_src_7          : 1;
} ism330dhcx_mlc4_src_t;
typedef struct {
    uint8_t mlc5_src_0          : 1;
    uint8_t mlc5_src_1          : 1;
    uint8_t mlc5_src_2          : 1;
    uint8_t mlc5_src_3          : 1;
    uint8_t mlc5_src_4          : 1;
    uint8_t mlc5_src_5          : 1;
    uint8_t mlc5_src_6          : 1;
    uint8_t mlc5_src_7          : 1;
} ism330dhcx_mlc5_src_t;
typedef struct {
    uint8_t mlc6_src_0          : 1;
    uint8_t mlc6_src_1          : 1;
    uint8_t mlc6_src_2          : 1;
    uint8_t mlc6_src_3          : 1;
    uint8_t mlc6_src_4          : 1;
    uint8_t mlc6_src_5          : 1;
    uint8_t mlc6_src_6          : 1;
    uint8_t mlc6_src_7          : 1;
} ism330dhcx_mlc6_src_t;
typedef struct {
    uint8_t mlc7_src_0          : 1;
    uint8_t mlc7_src_1          : 1;
    uint8_t mlc7_src_2          : 1;
    uint8_t mlc7_src_3          : 1;
    uint8_t mlc7_src_4          : 1;
    uint8_t mlc7_src_5          : 1;
    uint8_t mlc7_src_6          : 1;
    uint8_t mlc7_src_7          : 1;
} ism330dhcx_mlc7_src_t;

/***************** Embedded advanced features register description *******/
/*  External magnetometer sensitivity value register for the Finite State Machine (r/w).
    This register corresponds to the LSB-to-gauss conversion value of the external magnetometer sensor. The
    register value is expressed as half-precision floating-point format: SEEEEEFFFFFFFFFF
    (S: 1 sign bit; E: 5 exponent bits; F: 10 fraction bits).
    Default value of MAG_SENS[15:0] is 0x1624, corresponding to 0.0015 gauss/LSB.
*/
typedef struct {
    uint8_t mag_sens_0          : 1;
    uint8_t mag_sens_1          : 1;
    uint8_t mag_sens_2          : 1;
    uint8_t mag_sens_3          : 1;
    uint8_t mag_sens_4          : 1;
    uint8_t mag_sens_5          : 1;
    uint8_t mag_sens_6          : 1;
    uint8_t mag_sens_7          : 1;
} ism330dhcx_mag_sensitivity_l_t;
typedef struct {
    uint8_t mag_sens_8          : 1;
    uint8_t mag_sens_9          : 1;
    uint8_t mag_sens_10         : 1;
    uint8_t mag_sens_11         : 1;
    uint8_t mag_sens_12         : 1;
    uint8_t mag_sens_13         : 1;
    uint8_t mag_sens_14         : 1;
    uint8_t mag_sens_15         : 1;
} ism330dhcx_mag_sensitivity_h_t;

/*  Offset for X-axis hard-iron compensation register (r/w).
    The value is expressed as half-precision floating-point format: SEEEEEFFFFFFFFFF
    (S: 1 sign bit; E: 5 exponent bits; F: 10 fraction bits).
    **
    Offset for X-axis hard-iron compensation (MSbyte)
*/
typedef struct {
    uint8_t mag_offx_0          : 1;
    uint8_t mag_offx_1          : 1;
    uint8_t mag_offx_2          : 1;
    uint8_t mag_offx_3          : 1;
    uint8_t mag_offx_4          : 1;
    uint8_t mag_offx_5          : 1;
    uint8_t mag_offx_6          : 1;
    uint8_t mag_offx_7          : 1;
} ism330dhcx_mag_offx_l_t;
typedef struct {
    uint8_t mag_offx_8          : 1;
    uint8_t mag_offx_9          : 1;
    uint8_t mag_offx_10         : 1;
    uint8_t mag_offx_11         : 1;
    uint8_t mag_offx_12         : 1;
    uint8_t mag_offx_13         : 1;
    uint8_t mag_offx_14         : 1;
    uint8_t mag_offx_15         : 1;
} ism330dhcx_mag_offx_h_t;

/*  Offset for Y-axis hard-iron compensation register (r/w).
    The value is expressed as half-precision floating-point format: SEEEEEFFFFFFFFFF
    (S: 1 sign bit; E: 5 exponent bits; F: 10 fraction bits).
    **
    Offset for Y-axis hard-iron compensation (MSbyte)
*/
typedef struct {
    uint8_t mag_offy_0          : 1;
    uint8_t mag_offy_1          : 1;
    uint8_t mag_offy_2          : 1;
    uint8_t mag_offy_3          : 1;
    uint8_t mag_offy_4          : 1;
    uint8_t mag_offy_5          : 1;
    uint8_t mag_offy_6          : 1;
    uint8_t mag_offy_7          : 1;
} ism330dhcx_mag_offy_l_t;
typedef struct {
    uint8_t mag_offy_8          : 1;
    uint8_t mag_offy_9          : 1;
    uint8_t mag_offy_10         : 1;
    uint8_t mag_offy_11         : 1;
    uint8_t mag_offy_12         : 1;
    uint8_t mag_offy_13         : 1;
    uint8_t mag_offy_14         : 1;
    uint8_t mag_offy_15         : 1;
} ism330dhcx_mag_offy_h_t;

/*  Offset for Z-axis hard-iron compensation register (r/w).
    The value is expressed as half-precision floating-point format: SEEEEEFFFFFFFFFF
    (S: 1 sign bit; E: 5 exponent bits; F: 10 fraction bits).
    **
    Offset for Z-axis hard-iron compensation (MSbyte)
*/
typedef struct {
    uint8_t mag_offz_0          : 1;
    uint8_t mag_offz_1          : 1;
    uint8_t mag_offz_2          : 1;
    uint8_t mag_offz_3          : 1;
    uint8_t mag_offz_4          : 1;
    uint8_t mag_offz_5          : 1;
    uint8_t mag_offz_6          : 1;
    uint8_t mag_offz_7          : 1;
} ism330dhcx_mag_offz_l_t;
