life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
typedef struct {
    uint8_t mag_offz_8          : 1;
    uint8_t mag_offz_9          : 1;
    uint8_t mag_offz_10         : 1;
    uint8_t mag_offz_11         : 1;
    uint8_t mag_offz_12         : 1;
    uint8_t mag_offz_13         : 1;
    uint8_t mag_offz_14         : 1;
    uint8_t mag_offz_15         : 1;
} ism330dhcx_mag_offz_h_t;

/*  Soft-iron (3x3 symmetric) matrix correction register (r/w).
    The value is expressed as half-precision floating-point format: SEEEEEFFFFFFFFFF
    (S: 1 sign bit; E: 5 exponent bits; F: 10 fraction bits).
    **
    Soft-iron correction row1 col1 coefficient (LSbyte).
*/
typedef struct {
    uint8_t mag_si_xx_0         : 1;
    uint8_t mag_si_xx_1         : 1;
    uint8_t mag_si_xx_2         : 1;
    uint8_t mag_si_xx_3         : 1;
    uint8_t mag_si_xx_4         : 1;
    uint8_t mag_si_xx_5         : 1;
    uint8_t mag_si_xx_6         : 1;
    uint8_t mag_si_xx_7         : 1;
} ism330dhcx_mag_si_xx_l_t;
typedef struct {
    uint8_t mag_si_xx_8         : 1;
    uint8_t mag_si_xx_9         : 1;
    uint8_t mag_si_xx_10        : 1;
    uint8_t mag_si_xx_11        : 1;
    uint8_t mag_si_xx_12        : 1;
    uint8_t mag_si_xx_13        : 1;
    uint8_t mag_si_xx_14        : 1;
    uint8_t mag_si_xx_15        : 1;
} ism330dhcx_mag_si_xx_h_t;

/*  Soft-iron (3x3 symmetric) matrix correction register (r/w).
    The value is expressed as half-precision floating-point format: SEEEEEFFFFFFFFFF
    (S: 1 sign bit; E: 5 exponent bits; F: 10 fraction bits).
    **
    Soft-iron correction row1 col2 coefficient (LSbyte).
*/
typedef struct {
    uint8_t mag_si_xy_0         : 1;
    uint8_t mag_si_xy_1         : 1;
    uint8_t mag_si_xy_2         : 1;
    uint8_t mag_si_xy_3         : 1;
    uint8_t mag_si_xy_4         : 1;
    uint8_t mag_si_xy_5         : 1;
    uint8_t mag_si_xy_6         : 1;
    uint8_t mag_si_xy_7         : 1;
} ism330dhcx_mag_si_xy_l_t;
typedef struct {
    uint8_t mag_si_xy_8         : 1;
    uint8_t mag_si_xy_9         : 1;
    uint8_t mag_si_xy_10        : 1;
    uint8_t mag_si_xy_11        : 1;
    uint8_t mag_si_xy_12        : 1;
    uint8_t mag_si_xy_13        : 1;
    uint8_t mag_si_xy_14        : 1;
    uint8_t mag_si_xy_15        : 1;
} ism330dhcx_mag_si_xy_h_t;

/*  Soft-iron (3x3 symmetric) matrix correction register (r/w).
    The value is expressed as half-precision floating-point format: SEEEEEFFFFFFFFFF
    (S: 1 sign bit; E: 5 exponent bits; F: 10 fraction bits).
    **
    Soft-iron correction row1 col3 coefficient (LSbyte).
*/
typedef struct {
    uint8_t mag_si_xz_0         : 1;
    uint8_t mag_si_xz_1         : 1;
    uint8_t mag_si_xz_2         : 1;
    uint8_t mag_si_xz_3         : 1;
    uint8_t mag_si_xz_4         : 1;
    uint8_t mag_si_xz_5         : 1;
    uint8_t mag_si_xz_6         : 1;
    uint8_t mag_si_xz_7         : 1;
} ism330dhcx_mag_si_xz_l_t;
typedef struct {
    uint8_t mag_si_xz_8         : 1;
    uint8_t mag_si_xz_9         : 1;
    uint8_t mag_si_xz_10        : 1;
    uint8_t mag_si_xz_11        : 1;
    uint8_t mag_si_xz_12        : 1;
    uint8_t mag_si_xz_13        : 1;
    uint8_t mag_si_xz_14        : 1;
    uint8_t mag_si_xz_15        : 1;
} ism330dhcx_mag_si_xz_h_t;

/*  Soft-iron (3x3 symmetric) matrix correction register (r/w).
    The value is expressed as half-precision floating-point format: SEEEEEFFFFFFFFFF
    (S: 1 sign bit; E: 5 exponent bits; F: 10 fraction bits).
    **
    Soft-iron correction row2 col2 coefficient (LSbyte).
*/
typedef struct {
    uint8_t mag_si_yy_0         : 1;
    uint8_t mag_si_yy_1         : 1;
    uint8_t mag_si_yy_2         : 1;
    uint8_t mag_si_yy_3         : 1;
    uint8_t mag_si_yy_4         : 1;
    uint8_t mag_si_yy_5         : 1;
    uint8_t mag_si_yy_6         : 1;
    uint8_t mag_si_yy_7         : 1;
} ism330dhcx_mag_si_yy_l_t;
typedef struct {
    uint8_t mag_si_yy_8         : 1;
    uint8_t mag_si_yy_9         : 1;
    uint8_t mag_si_yy_10        : 1;
    uint8_t mag_si_yy_11        : 1;
    uint8_t mag_si_yy_12        : 1;
    uint8_t mag_si_yy_13        : 1;
    uint8_t mag_si_yy_14        : 1;
    uint8_t mag_si_yy_15        : 1;
} ism330dhcx_mag_si_yy_h_t;

/*  Soft-iron (3x3 symmetric) matrix correction register (r/w).
    The value is expressed as half-precision floating-point format: SEEEEEFFFFFFFFFF
    (S: 1 sign bit; E: 5 exponent bits; F: 10 fraction bits).
    **
    Soft-iron correction row2 col3 coefficient (LSbyte).
*/
typedef struct {
    uint8_t mag_si_yz_0         : 1;
    uint8_t mag_si_yz_1         : 1;
    uint8_t mag_si_yz_2         : 1;
    uint8_t mag_si_yz_3         : 1;
    uint8_t mag_si_yz_4         : 1;
    uint8_t mag_si_yz_5         : 1;
    uint8_t mag_si_yz_6         : 1;
    uint8_t mag_si_yz_7         : 1;
} ism330dhcx_mag_si_yz_l_t;
typedef struct {
    uint8_t mag_si_yz_8         : 1;
    uint8_t mag_si_yz_9         : 1;
    uint8_t mag_si_yz_10        : 1;
    uint8_t mag_si_yz_11        : 1;
    uint8_t mag_si_yz_12        : 1;
    uint8_t mag_si_yz_13        : 1;
    uint8_t mag_si_yz_14        : 1;
    uint8_t mag_si_yz_15        : 1;
} ism330dhcx_mag_si_yz_h_t;

/*  Soft-iron (3x3 symmetric) matrix correction register (r/w).
    The value is expressed as half-precision floating-point format: SEEEEEFFFFFFFFFF
    (S: 1 sign bit; E: 5 exponent bits; F: 10 fraction bits).
    **
    Soft-iron correction row3 col3 coefficient (LSbyte).
*/
typedef struct {
    uint8_t mag_si_zz_0         : 1;
    uint8_t mag_si_zz_1         : 1;
    uint8_t mag_si_zz_2         : 1;
    uint8_t mag_si_zz_3         : 1;
    uint8_t mag_si_zz_4         : 1;
    uint8_t mag_si_zz_5         : 1;
    uint8_t mag_si_zz_6         : 1;
    uint8_t mag_si_zz_7         : 1;
} ism330dhcx_mag_si_zz_l_t;
typedef struct {
    uint8_t mag_si_zz_8         : 1;
    uint8_t mag_si_zz_9         : 1;
    uint8_t mag_si_zz_10        : 1;
    uint8_t mag_si_zz_11        : 1;
    uint8_t mag_si_zz_12        : 1;
    uint8_t mag_si_zz_13        : 1;
    uint8_t mag_si_zz_14        : 1;
    uint8_t mag_si_zz_15        : 1;
} ism330dhcx_mag_si_zz_h_t;

/*  External magnetometer coordinates (Z and Y axes) rotation register */
typedef struct {
    // Magnetometer Z-axis coordinates rotation (to be aligned to accelerometer/gyroscope axes orientation)
    uint8_t mag_z_axis          : 3;
    uint8_t reserved0           : 1;
    // Magnetometer Y-axis coordinates rotation (to be aligned to accelerometer/gyroscope axes orientation)
    uint8_t mag_y_axis          : 3;
    uint8_t reserved1           : 1;
} ism330dhcx_mag_cfg_a_t;

