life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
/*  External magnetometer coordinates (X-axis) rotation register */
typedef struct {
    // Magnetometer X-axis coordinates rotation (to be aligned to accelerometer/gyroscope axes orientation)
    uint8_t mag_x_axis          : 3;
    uint8_t reserved0           : 5;
} ism330dhcx_mag_cfg_b_t;

/* FSM long counter timeout register */
typedef struct {
    uint8_t fsm_lc_timeout0     : 1;
    uint8_t fsm_lc_timeout1     : 1;
    uint8_t fsm_lc_timeout2     : 1;
    uint8_t fsm_lc_timeout3     : 1;
    uint8_t fsm_lc_timeout4     : 1;
    uint8_t fsm_lc_timeout5     : 1;
    uint8_t fsm_lc_timeout6     : 1;
    uint8_t fsm_lc_timeout7     : 1;
} ism330dhcx_fsm_lc_timeout_l_t;
typedef struct {
    uint8_t fsm_lc_timeout8     : 1;
    uint8_t fsm_lc_timeout9     : 1;
    uint8_t fsm_lc_timeout10    : 1;
    uint8_t fsm_lc_timeout11    : 1;
    uint8_t fsm_lc_timeout12    : 1;
    uint8_t fsm_lc_timeout13    : 1;
    uint8_t fsm_lc_timeout14    : 1;
    uint8_t fsm_lc_timeout15    : 1;
} ism330dhcx_fsm_lc_timeout_h_t;

/*  FSM number of programs register */
typedef struct {
    uint8_t fsm_n_prog0     : 1;
    uint8_t fsm_n_prog1     : 1;
    uint8_t fsm_n_prog2     : 1;
    uint8_t fsm_n_prog3     : 1;
    uint8_t fsm_n_prog4     : 1;
    uint8_t fsm_n_prog5     : 1;
    uint8_t fsm_n_prog6     : 1;
    uint8_t fsm_n_prog7     : 1;
} ism330dhcx_fsm_programs_t;

/*  FSM start address register (r/w).
    First available address is 0x033C.  */
typedef struct {
    uint8_t fsm_start0      : 1;
    uint8_t fsm_start1      : 1;
    uint8_t fsm_start2      : 1;
    uint8_t fsm_start3      : 1;
    uint8_t fsm_start4      : 1;
    uint8_t fsm_start5      : 1;
    uint8_t fsm_start6      : 1;
    uint8_t fsm_start7      : 1;
} ism330dhcx_fsm_start_add_l_t;
typedef struct {
    uint8_t fsm_start8      : 1;
    uint8_t fsm_start9      : 1;
    uint8_t fsm_start10     : 1;
    uint8_t fsm_start11     : 1;
    uint8_t fsm_start12     : 1;
    uint8_t fsm_start13     : 1;
    uint8_t fsm_start14     : 1;
    uint8_t fsm_start15     : 1;
} ism330dhcx_fsm_start_add_h_t;

/* Pedometer configuration register */
typedef struct {
    uint8_t reserved0       : 3;
    // Set when user wants to generate interrupt only on count overflow event.
    uint8_t carry_count_en  : 1;
    uint8_t reserved1       : 4;
} ism330dhcx_pedo_cmd_reg_t;

/*  Pedometer debounce configuration register
    Debounce threshold.
    Minimum number of steps to increment the step counter (debounce). */
typedef struct {
    uint8_t deb_step0       : 1;
    uint8_t deb_step1       : 1;
    uint8_t deb_step2       : 1;
    uint8_t deb_step3       : 1;
    uint8_t deb_step4       : 1;
    uint8_t deb_step5       : 1;
    uint8_t deb_step6       : 1;
    uint8_t deb_step7       : 1;
} ism330dhcx_pedo_deb_conf_t;

/* Time period register for step detection on delta time
    Time period value   */
typedef struct {
    uint8_t pd_sc_0         : 1;
    uint8_t pd_sc_1         : 1;
    uint8_t pd_sc_2         : 1;
    uint8_t pd_sc_3         : 1;
    uint8_t pd_sc_4         : 1;
    uint8_t pd_sc_5         : 1;
    uint8_t pd_sc_6         : 1;
    uint8_t pd_sc_7         : 1;
} ism330dhcx_pedo_sc_deltat_l_t;
typedef struct {
    uint8_t pd_sc_8         : 1;
    uint8_t pd_sc_9         : 1;
    uint8_t pd_sc_10        : 1;
    uint8_t pd_sc_11        : 1;
    uint8_t pd_sc_12        : 1;
    uint8_t pd_sc_13        : 1;
    uint8_t pd_sc_14        : 1;
    uint8_t pd_sc_15        : 1;
} ism330dhcx_pedo_sc_deltat_h_t;

/*  External magnetometer sensitivity
    value register for the Machine Learning Core */
typedef struct {
    uint8_t mlc_mag_s_0     : 1;
    uint8_t mlc_mag_s_1     : 1;
    uint8_t mlc_mag_s_2     : 1;
    uint8_t mlc_mag_s_3     : 1;
    uint8_t mlc_mag_s_4     : 1;
    uint8_t mlc_mag_s_5     : 1;
    uint8_t mlc_mag_s_6     : 1;
    uint8_t mlc_mag_s_7     : 1;
} ism330dhcx_mlc_mag_sensitivity_l_t;
typedef struct {
    uint8_t mlc_mag_s_8     : 1;
    uint8_t mlc_mag_s_9     : 1;
    uint8_t mlc_mag_s_10    : 1;
    uint8_t mlc_mag_s_11    : 1;
    uint8_t mlc_mag_s_12    : 1;
    uint8_t mlc_mag_s_13    : 1;
    uint8_t mlc_mag_s_14    : 1;
    uint8_t mlc_mag_s_15    : 1;
} ism330dhcx_mlc_mag_sensitivity_h_t;

/******************* Sensor Hub *********************/

/*  Sensor hub output register (r)
    First byte associated to external sensors.
    The content of the register is consistent with the SLAVEx_CONFIG
    number of read operation configurations
    (for external sensors from x = 0 to x = 3). */
typedef struct {
    uint8_t sensor_hub1_0   : 1;
    uint8_t sensor_hub1_1   : 1;
    uint8_t sensor_hub1_2   : 1;
    uint8_t sensor_hub1_3   : 1;
    uint8_t sensor_hub1_4   : 1;
    uint8_t sensor_hub1_5   : 1;
    uint8_t sensor_hub1_6   : 1;
    uint8_t sensor_hub1_7   : 1;
} ism330dhcx_sensor_hub_1_t;
typedef struct {
    uint8_t sensor_hub2_0   : 1;
    uint8_t sensor_hub2_1   : 1;
    uint8_t sensor_hub2_2   : 1;
    uint8_t sensor_hub2_3   : 1;
    uint8_t sensor_hub2_4   : 1;
    uint8_t sensor_hub2_5   : 1;
    uint8_t sensor_hub2_6   : 1;
    uint8_t sensor_hub2_7   : 1;
} ism330dhcx_sensor_hub_2_t;
typedef struct {
    uint8_t sensor_hub3_0   : 1;
    uint8_t sensor_hub3_1   : 1;
    uint8_t sensor_hub3_2   : 1;
    uint8_t sensor_hub3_3   : 1;
    uint8_t sensor_hub3_4   : 1;
    uint8_t sensor_hub3_5   : 1;
    uint8_t sensor_hub3_6   : 1;
    uint8_t sensor_hub3_7   : 1;
} ism330dhcx_sensor_hub_3_t;
typedef struct {
    uint8_t sensor_hub4_0   : 1;
    uint8_t sensor_hub4_1   : 1;
    uint8_t sensor_hub4_2   : 1;
    uint8_t sensor_hub4_3   : 1;
    uint8_t sensor_hub4_4   : 1;
    uint8_t sensor_hub4_5   : 1;
    uint8_t sensor_hub4_6   : 1;
    uint8_t sensor_hub4_7   : 1;
} ism330dhcx_sensor_hub_4_t;
typedef struct {
    uint8_t sensor_hub5_0   : 1;
    uint8_t sensor_hub5_1   : 1;
    uint8_t sensor_hub5_2   : 1;
    uint8_t sensor_hub5_3   : 1;
    uint8_t sensor_hub5_4   : 1;
    uint8_t sensor_hub5_5   : 1;
    uint8_t sensor_hub5_6   : 1;
    uint8_t sensor_hub5_7   : 1;
} ism330dhcx_sensor_hub_5_t;
