life777event/STM32_ISM330DHCX/test_ism330dhcx/Custom_libraries/Inc/ism330dhcx_regs.h
typedef struct {
    uint8_t sensor_hub6_0   : 1;
    uint8_t sensor_hub6_1   : 1;
    uint8_t sensor_hub6_2   : 1;
    uint8_t sensor_hub6_3   : 1;
    uint8_t sensor_hub6_4   : 1;
    uint8_t sensor_hub6_5   : 1;
    uint8_t sensor_hub6_6   : 1;
    uint8_t sensor_hub6_7   : 1;
} ism330dhcx_sensor_hub_6_t;
typedef struct {
    uint8_t sensor_hub7_0   : 1;
    uint8_t sensor_hub7_1   : 1;
    uint8_t sensor_hub7_2   : 1;
    uint8_t sensor_hub7_3   : 1;
    uint8_t sensor_hub7_4   : 1;
    uint8_t sensor_hub7_5   : 1;
    uint8_t sensor_hub7_6   : 1;
    uint8_t sensor_hub7_7   : 1;
} ism330dhcx_sensor_hub_7_t;
typedef struct {
    uint8_t sensor_hub8_0   : 1;
    uint8_t sensor_hub8_1   : 1;
    uint8_t sensor_hub8_2   : 1;
    uint8_t sensor_hub8_3   : 1;
    uint8_t sensor_hub8_4   : 1;
    uint8_t sensor_hub8_5   : 1;
    uint8_t sensor_hub8_6   : 1;
    uint8_t sensor_hub8_7   : 1;
} ism330dhcx_sensor_hub_8_t;
typedef struct {
    uint8_t sensor_hub9_0   : 1;
    uint8_t sensor_hub9_1   : 1;
    uint8_t sensor_hub9_2   : 1;
    uint8_t sensor_hub9_3   : 1;
    uint8_t sensor_hub9_4   : 1;
    uint8_t sensor_hub9_5   : 1;
    uint8_t sensor_hub9_6   : 1;
    uint8_t sensor_hub9_7   : 1;
} ism330dhcx_sensor_hub_9_t;
typedef struct {
    uint8_t sensor_hub10_0  : 1;
    uint8_t sensor_hub10_1  : 1;
    uint8_t sensor_hub10_2  : 1;
    uint8_t sensor_hub10_3  : 1;
    uint8_t sensor_hub10_4  : 1;
    uint8_t sensor_hub10_5  : 1;
    uint8_t sensor_hub10_6  : 1;
    uint8_t sensor_hub10_7  : 1;
} ism330dhcx_sensor_hub_10_t;
typedef struct {
    uint8_t sensor_hub11_0  : 1;
    uint8_t sensor_hub11_1  : 1;
    uint8_t sensor_hub11_2  : 1;
    uint8_t sensor_hub11_3  : 1;
    uint8_t sensor_hub11_4  : 1;
    uint8_t sensor_hub11_5  : 1;
    uint8_t sensor_hub11_6  : 1;
    uint8_t sensor_hub11_7  : 1;
} ism330dhcx_sensor_hub_11_t;
typedef struct {
    uint8_t sensor_hub12_0  : 1;
    uint8_t sensor_hub12_1  : 1;
    uint8_t sensor_hub12_2  : 1;
    uint8_t sensor_hub12_3  : 1;
    uint8_t sensor_hub12_4  : 1;
    uint8_t sensor_hub12_5  : 1;
    uint8_t sensor_hub12_6  : 1;
    uint8_t sensor_hub12_7  : 1;
} ism330dhcx_sensor_hub_12_t;
typedef struct {
    uint8_t sensor_hub13_0  : 1;
    uint8_t sensor_hub13_1  : 1;
    uint8_t sensor_hub13_2  : 1;
    uint8_t sensor_hub13_3  : 1;
    uint8_t sensor_hub13_4  : 1;
    uint8_t sensor_hub13_5  : 1;
    uint8_t sensor_hub13_6  : 1;
    uint8_t sensor_hub13_7  : 1;
} ism330dhcx_sensor_hub_13_t;
typedef struct {
    uint8_t sensor_hub14_0  : 1;
    uint8_t sensor_hub14_1  : 1;
    uint8_t sensor_hub14_2  : 1;
    uint8_t sensor_hub14_3  : 1;
    uint8_t sensor_hub14_4  : 1;
    uint8_t sensor_hub14_5  : 1;
    uint8_t sensor_hub14_6  : 1;
    uint8_t sensor_hub14_7  : 1;
} ism330dhcx_sensor_hub_14_t;
typedef struct {
    uint8_t sensor_hub15_0  : 1;
    uint8_t sensor_hub15_1  : 1;
    uint8_t sensor_hub15_2  : 1;
    uint8_t sensor_hub15_3  : 1;
    uint8_t sensor_hub15_4  : 1;
    uint8_t sensor_hub15_5  : 1;
    uint8_t sensor_hub15_6  : 1;
    uint8_t sensor_hub15_7  : 1;
} ism330dhcx_sensor_hub_15_t;
typedef struct {
    uint8_t sensor_hub16_0  : 1;
    uint8_t sensor_hub16_1  : 1;
    uint8_t sensor_hub16_2  : 1;
    uint8_t sensor_hub16_3  : 1;
    uint8_t sensor_hub16_4  : 1;
    uint8_t sensor_hub16_5  : 1;
    uint8_t sensor_hub16_6  : 1;
    uint8_t sensor_hub16_7  : 1;
} ism330dhcx_sensor_hub_16_t;
typedef struct {
    uint8_t sensor_hub17_0  : 1;
    uint8_t sensor_hub17_1  : 1;
    uint8_t sensor_hub17_2  : 1;
    uint8_t sensor_hub17_3  : 1;
    uint8_t sensor_hub17_4  : 1;
    uint8_t sensor_hub17_5  : 1;
    uint8_t sensor_hub17_6  : 1;
    uint8_t sensor_hub17_7  : 1;
} ism330dhcx_sensor_hub_17_t;
typedef struct {
    uint8_t sensor_hub18_0  : 1;
    uint8_t sensor_hub18_1  : 1;
    uint8_t sensor_hub18_2  : 1;
    uint8_t sensor_hub18_3  : 1;
    uint8_t sensor_hub18_4  : 1;
    uint8_t sensor_hub18_5  : 1;
    uint8_t sensor_hub18_6  : 1;
    uint8_t sensor_hub18_7  : 1;
} ism330dhcx_sensor_hub_18_t;

/*  Master configuration register */
typedef struct {
    // Number of external sensors to be read by the sensor hub.
    uint8_t aux_sens_on         : 2;
    // Sensor hub I²C master enable
    uint8_t master_on           : 1;
    // Master I²C pull-up enable.
    uint8_t shub_pu_en          : 1;
    // I²C interface pass-throuh.
    uint8_t pass_through_mode   : 1;
    // Sensor hub trigger signal selection.
    uint8_t start_config        : 1;
    // Slave 0 write operation is performed only at the first sensor hub cycle.
    uint8_t write_once          : 1;
    // Reset Master logic and output registers. Must be set to '1' and then set it to '0'.
} ism330dhcx_master_config_t;

/* I²C slave address of the first external sensor (Sensor 1) register */
typedef struct {
    // Read/write operation on Sensor 1.
    uint8_t rw_0                : 1;
    // I²C slave address of Sensor1 that can be read by the sensor hub.
    uint8_t slave0_add          : 7;
} ism330dhcx_slv0_add_t;

/* Adress of register on the first external sensor (Sensor 1) register
    Address of register on Sensor1 that has to be read/written according
    to the rw_0 bit value in SLV0_ADD (15h). */
typedef struct {
    uint8_t slave0_reg0         : 1;
    uint8_t slave0_reg1         : 1;
    uint8_t slave0_reg2         : 1;
    uint8_t slave0_reg3         : 1;
    uint8_t slave0_reg4         : 1;
    uint8_t slave0_reg5         : 1;
    uint8_t slave0_reg6         : 1;
    uint8_t slave0_reg7         : 1;
} ism330dhcx_slv0_subadd_t;

/* First external sensor (Sensor1) configuration and sensor hub settings register */
typedef struct {
    // Number of read operations on Sensor 1.
    uint8_t slave0_numop        : 3;
    // Enable FIFO data batching of first slave.
    uint8_t batch_ext_sens_0_en : 1;
    uint8_t reserved0           : 2;
    // Rate at which the master communicates.
    uint8_t shub_odr            : 2;
} ism330dhcx_slave0_config_t;

/* I²C slave address of the first external sensor (Sensor 2) register */
typedef struct {
    // Read/write operation on Sensor 1.
    uint8_t r_1                : 1;
    // I²C slave address of Sensor1 that can be read by the sensor hub.
    uint8_t slave1_add         : 7;
} ism330dhcx_slv1_add_t;

/* Adress of register on the first external sensor (Sensor 2) register
    Address of register on Sensor1 that has to be read/written according
    to the rw_0 bit value in SLV1_ADD (15h). */
typedef struct {
    uint8_t slave1_reg0         : 1;
    uint8_t slave1_reg1         : 1;
    uint8_t slave1_reg2         : 1;
    uint8_t slave1_reg3         : 1;
    uint8_t slave1_reg4         : 1;
    uint8_t slave1_reg5         : 1;
    uint8_t slave1_reg6         : 1;
    uint8_t slave1_reg7         : 1;
} ism330dhcx_slv1_subadd;

/* First external sensor (Sensor2) configuration and sensor hub settings register */
typedef struct {
    // Number of read operations on Sensor 1.
    uint8_t slave1_numop        : 3;
    // Enable FIFO data batching of first slave.
    uint8_t batch_ext_sens_1_en : 1;
    uint8_t reserved0           : 4;
} ism330dhcx_slave1_config_t;

/* I²C slave address of the first external sensor (Sensor 3) register */
typedef struct {
    // Read/write operation on Sensor 1.
    uint8_t r_2                : 1;
    // I²C slave address of Sensor1 that can be read by the sensor hub.
    uint8_t slave2_add         : 7;
} ism330dhcx_slv2_add_t;

/* Adress of register on the first external sensor (Sensor 3) register
    Address of register on Sensor1 that has to be read/written according
    to the rw_0 bit value in SLV2_ADD (15h). */
typedef struct {
    uint8_t slave2_reg0         : 1;
    uint8_t slave2_reg1         : 1;
    uint8_t slave2_reg2         : 1;
    uint8_t slave2_reg3         : 1;
    uint8_t slave2_reg4         : 1;
    uint8_t slave2_reg5         : 1;
    uint8_t slave2_reg6         : 1;
    uint8_t slave2_reg7         : 1;
} ism330dhcx_slv2_subadd_t;

/* First external sensor (Sensor3) configuration and sensor hub settings register */
typedef struct {
    // Number of read operations on Sensor 1.
    uint8_t slave2_numop        : 3;
    // Enable FIFO data batching of first slave.
    uint8_t batch_ext_sens_2_en : 1;
    uint8_t reserved0           : 4;
} ism330dhcx_slave2_config_t;

/* I²C slave address of the first external sensor (Sensor 4) register */
typedef struct {
    // Read/write operation on Sensor 1.
    uint8_t r_3                : 1;
    // I²C slave address of Sensor1 that can be read by the sensor hub.
    uint8_t slave3_add         : 7;
} ism330dhcx_slv3_add_t;

/* Adress of register on the first external sensor (Sensor 3) register
    Address of register on Sensor1 that has to be read/written according
    to the rw_0 bit value in SLV2_ADD (15h). */
typedef struct {
    uint8_t slave3_reg0         : 1;
    uint8_t slave3_reg1         : 1;
    uint8_t slave3_reg2         : 1;
    uint8_t slave3_reg3         : 1;
    uint8_t slave3_reg4         : 1;
    uint8_t slave3_reg5         : 1;
    uint8_t slave3_reg6         : 1;
    uint8_t slave3_reg7         : 1;
} ism330dhcx_slv3_subadd_t;

/* First external sensor (Sensor3) configuration and sensor hub settings register */
typedef struct {
    // Number of read operations on Sensor 1.
    uint8_t slave3_numop        : 3;
    // Enable FIFO data batching of first slave.
    uint8_t batch_ext_sens_3_en : 1;
    uint8_t reserved0           : 4;
} ism330dhcx_slave3_config_t;

/*  Data to be written into the slave device register */
typedef struct {
    // Data to be written into the slave 0 device according to the rw_0 bit in register SLV0_ADD (15h).
    uint8_t slave0_dataw        : 8;
} ism330dhcx_datawrite_slv0_t;

typedef struct {
    // Sensor hub communication status.
    uint8_t sens_hub_endop      : 1;
    uint8_t reserved0           : 2;
    // Those bits are set to 1 if Not acknowledge occurs on slave N communication.
    uint8_t slave0_nack         : 1;
    uint8_t slave1_nack         : 1;
    uint8_t slave2_nack         : 1;
    uint8_t slave3_nack         : 1;
    // When the bit WRITE_ONCE in MASTER_CONFIG (14h) is configured as 1,
    //  this bit is set to 1 when the write operation on slave 0 has been performed and completed.
    uint8_t wr_once_done        : 1;
} ism330dhcx_status_master_t;

#endif
